src/zeromq.org
#+title: ZeroMQ

NOTE@201712：重读这篇笔记。感觉MQ对系统可能至关重要，以及了解MQ在系统中可能出现的使用模式。当时对里面很多地方没有搞清楚，所以笔记里面有很多东西也没有办法阅读。

** Introduction
ZMQ希望用户在编写应用程序方面，更加关心消息通信而不是socket连接。在内部已经使用异步方式帮用户处理好了网络IO读写以及数据成帧，使得用户在处理的时候只需要关注消息本身。
ZMQ所支持的消息传输模型有很多种，比如push-pull,pub-sub,request-reply以及exclusive-pair,应该可以涵盖应用层面所有的消息通讯方式。同时ZMQ本身可以底层允许选择不同的通信协议，
比如tcp,ipc(进程间通信),inproc(线程间通信).

ZMQ (ZeroMQ, 0MQ, zmq) looks like an embeddable networking library but acts like a concurrency framework. It gives you sockets that carry whole messages across various transports like in-process, inter-process, TCP, and multicast. You can connect sockets N-to-N with patterns like fanout, pub-sub, task distribution, and request-reply. It's fast enough to be the fabric for clustered products. Its asynchronous I/O model gives you scalable multicore applications, built as asynchronous message-processing tasks. It has a score of language APIs and runs on most operating systems. ZMQ is from iMatix and is LGPL open source.

首先阅读一下manual.然后看看guide里面包括很多设计细节和使用细节东西。最后可以阅读一下API reference.关于Background方面的内容也有一些whitepapers可以参考。
- http://www.zeromq.org/intro:read-the-manual
- http://zguide.zeromq.org/page:all
- http://api.zeromq.org/2-1:_start
- http://www.zeromq.org/whitepapers:multithreading-magic
- python binding: http://zeromq.github.io/pyzmq/

ZMQ总结了几种消息通信模型可以覆盖所有的应用程序，分别是下面这几种：
- Exclusive-Pair
- Publish-Subscribe
- Push-Pull
- Request-Reply
我们会在后面仔细讨论每一种消息通信模型。

使用ZMQ之后的话不像我们所认识一样的server必须在client之前启动。在ZMQ下面的话client完全可以在server之前启动。一旦连接顺序并不按照我们所想象的那样工作的话，连接顺序是无关的时候，那么客户端和服务端这两个概念就非常模糊了。我们必须重新考虑什么是server,什么是client.ZMQ给出一个非常实际的答案。我们将socket嵌入到网络拓扑的时候，server应该是网络结构中稳定的部分，而client应该是网络结构中比较易变的部分。（NOTE@201712: 注意MQ这个名字，这就决定了为什么可以不限制client/server启动顺序）

What this means is that you should always think in terms of "servers" as stable parts of your topology, with more-or-less fixed endpoint addresses, and "clients" as dynamic parts that come and go. Then, design your application around this model. The chances that it will "just work" are much better like that.

*** Example
首先我们看看ZMQ的使用情况。我们以简单的Request-Reply消息模型为例。所谓Request-Reply模型就是client发送一个消息然后等待回应，而server接收到消息然后立刻回复。
这是一个lockstep的过程，就是说中途不能够切换做另外的事情，比如client发送消息之后就不能够再发送必须等待回应，而server接收到消息之后必须立刻恢复而不能够再次接收。
咋一看这是一个同步过程，但是后面可以看到ZMQ允许完成异步的Request-Reply.使用这种简单的通信模型我们可以很快地写出一个echo服务。

#+BEGIN_SRC C++
//============================================================
//client.cc.send 'hello' always to server,which hosts on localhost:19870
//============================================================

#include <zmq.h>
#include <string.h>
#include <stdio.h>
#include <unistd.h>

int main() {
    void* ctx=zmq_init(1);
    printf("connect to server 'localhost:19870'\n");
    void* req=zmq_socket(ctx,ZMQ_REQ);
    zmq_connect(req,"tcp://localhost:19870");
    for(int i=0; i<10; i++) {
        zmq_msg_t request;
        zmq_msg_init_size(&request,6);
        //including trailing '\0'.
        memcpy(zmq_msg_data(&request),"hello",6);
        printf("[C]send 'hello'\n");
        // 0 means in block way.
        zmq_send(req,&request,0);
        zmq_msg_close(&request);
        zmq_msg_t reply;
        zmq_msg_init(&reply);
        // 0 means in block way.
        zmq_recv(req,&reply,0);
        printf("[C]recv '%s'\n",zmq_msg_data(&reply));
        zmq_msg_close(&reply);
    }
    zmq_close(req);
    zmq_term(ctx);
    return 0;
}

//============================================================
//server.cc which hosts on *:19870
//============================================================

#include <zmq.h>
#include <string.h>
#include <stdio.h>
#include <unistd.h>

int main() {
    void* ctx=zmq_init(1);
    printf("bind to '*:19870'\n");
    void* rep=zmq_socket(ctx,ZMQ_REP);
    zmq_bind(rep,"tcp://*:19870");
    while(1){
        zmq_msg_t request;
        zmq_msg_init(&request);
        // 0 means in block way
        zmq_recv(rep,&request,0);
        const char* s=(const char*)zmq_msg_data(&request);
        printf("[S]recv '%s'\n",s);
        zmq_msg_t reply;
        // include trailing '\0'.
        zmq_msg_init_size(&reply,strlen(s)+1);
        memcpy(zmq_msg_data(&reply),s,strlen(s)+1);
        zmq_msg_close(&request);
        // 0 means in block way.
        printf("[S]send '%s'\n",s);
        zmq_send(rep,&reply,0);
        zmq_msg_close(&reply);
    }
    zmq_close(rep);
    zmq_term(ctx);
    return 0;
}
#+END_SRC
从编写角度来看的话确实简化了不少
- zmq_init创建一个context.这个context就可以认为是一个MQ实例。1表示IO线程数。
- zmq_socket根据context来创建一个socket,后面类型指定了MQ通信类型。
- zmq_bind/zmq_connect可以进行绑定进行监听或者是进行连接。
- zmq_msg_init/zmq_msg_init_size可以用来初始化一个message
- zmq_send/zmq_recv可以进行message的发送和接收。
- zmq_msg_close销毁一个message
- zmq_close关闭一个socket
- zmq_term销毁一个context

ZMQ底层做好了poller机制，对于server来说的话将多个connection映射到一个socket上面来了。底层使用其他线程完成了IO读写。
这里可以看到如果使用TCP的话底层应该是字节流，而我们没有指定任何成帧策略就得到了一条条消息，可以看到ZMQ内置有一个字节流成帧策略。

