html/zeromq.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ZeroMQ</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">ZeroMQ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Example</a></li>
<li><a href="#sec-1-2">1.2. Protocol</a></li>
<li><a href="#sec-1-3">1.3. Message</a></li>
<li><a href="#sec-1-4">1.4. Identity</a></li>
<li><a href="#sec-1-5">1.5. Device</a></li>
<li><a href="#sec-1-6">1.6. Congestion</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Pattern</a>
<ul>
<li><a href="#sec-2-1">2.1. Exclusive-Pair</a></li>
<li><a href="#sec-2-2">2.2. Publish-Subscribe</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Missing Message</a></li>
<li><a href="#sec-2-2-2">2.2.2. Congestion Control</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Push-Pull</a></li>
<li><a href="#sec-2-4">2.4. Request-Reply</a></li>
</ul>
</li>
<li><a href="#sec-3">3. API</a>
<ul>
<li><a href="#sec-3-1">3.1. Description</a></li>
<li><a href="#sec-3-2">3.2. Context</a></li>
<li><a href="#sec-3-3">3.3. Messages</a></li>
<li><a href="#sec-3-4">3.4. Sockets</a></li>
<li><a href="#sec-3-5">3.5. Options</a></li>
<li><a href="#sec-3-6">3.6. Transports</a></li>
<li><a href="#sec-3-7">3.7. Devices</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Philosophy</a>
<ul>
<li><a href="#sec-4-1">4.1. Fixing the World</a></li>
<li><a href="#sec-4-2">4.2. Programming with ZMQ</a></li>
<li><a href="#sec-4-3">4.3. Why We Needed ZMQ</a></li>
<li><a href="#sec-4-4">4.4. The Zen of Zero</a></li>
<li><a href="#sec-4-5">4.5. Handling Errors and ETERM</a></li>
<li><a href="#sec-4-6">4.6. Multithreading with ZMQ</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
NOTE@201712：重读这篇笔记。感觉MQ对系统可能至关重要，以及了解MQ在系统中可能出现的使用模式。当时对里面很多地方没有搞清楚，所以笔记里面有很多东西也没有办法阅读。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
ZMQ希望用户在编写应用程序方面，更加关心消息通信而不是socket连接。在内部已经使用异步方式帮用户处理好了网络IO读写以及数据成帧，使得用户在处理的时候只需要关注消息本身。
ZMQ所支持的消息传输模型有很多种，比如push-pull,pub-sub,request-reply以及exclusive-pair,应该可以涵盖应用层面所有的消息通讯方式。同时ZMQ本身可以底层允许选择不同的通信协议，
比如tcp,ipc(进程间通信),inproc(线程间通信).
</p>

<p>
ZMQ (ZeroMQ, 0MQ, zmq) looks like an embeddable networking library but acts like a concurrency framework. It gives you sockets that carry whole messages across various transports like in-process, inter-process, TCP, and multicast. You can connect sockets N-to-N with patterns like fanout, pub-sub, task distribution, and request-reply. It's fast enough to be the fabric for clustered products. Its asynchronous I/O model gives you scalable multicore applications, built as asynchronous message-processing tasks. It has a score of language APIs and runs on most operating systems. ZMQ is from iMatix and is LGPL open source.
</p>

<p>
首先阅读一下manual.然后看看guide里面包括很多设计细节和使用细节东西。最后可以阅读一下API reference.关于Background方面的内容也有一些whitepapers可以参考。
</p>
<ul class="org-ul">
<li><a href="http://www.zeromq.org/intro:read-the-manual">http://www.zeromq.org/intro:read-the-manual</a>
</li>
<li><a href="http://zguide.zeromq.org/page:all">http://zguide.zeromq.org/page:all</a>
</li>
<li><a href="http://api.zeromq.org/2-1:_start">http://api.zeromq.org/2-1:_start</a>
</li>
<li><a href="http://www.zeromq.org/whitepapers:multithreading-magic">http://www.zeromq.org/whitepapers:multithreading-magic</a>
</li>
<li>python binding: <a href="http://zeromq.github.io/pyzmq/">http://zeromq.github.io/pyzmq/</a>
</li>
</ul>

<p>
ZMQ总结了几种消息通信模型可以覆盖所有的应用程序，分别是下面这几种：
</p>
<ul class="org-ul">
<li>Exclusive-Pair
</li>
<li>Publish-Subscribe
</li>
<li>Push-Pull
</li>
<li>Request-Reply
</li>
</ul>
<p>
我们会在后面仔细讨论每一种消息通信模型。
</p>

<p>
使用ZMQ之后的话不像我们所认识一样的server必须在client之前启动。在ZMQ下面的话client完全可以在server之前启动。一旦连接顺序并不按照我们所想象的那样工作的话，连接顺序是无关的时候，那么客户端和服务端这两个概念就非常模糊了。我们必须重新考虑什么是server,什么是client.ZMQ给出一个非常实际的答案。我们将socket嵌入到网络拓扑的时候，server应该是网络结构中稳定的部分，而client应该是网络结构中比较易变的部分。（NOTE@201712: 注意MQ这个名字，这就决定了为什么可以不限制client/server启动顺序）
</p>

<p>
What this means is that you should always think in terms of "servers" as stable parts of your topology, with more-or-less fixed endpoint addresses, and "clients" as dynamic parts that come and go. Then, design your application around this model. The chances that it will "just work" are much better like that.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
首先我们看看ZMQ的使用情况。我们以简单的Request-Reply消息模型为例。所谓Request-Reply模型就是client发送一个消息然后等待回应，而server接收到消息然后立刻回复。
这是一个lockstep的过程，就是说中途不能够切换做另外的事情，比如client发送消息之后就不能够再发送必须等待回应，而server接收到消息之后必须立刻恢复而不能够再次接收。
咋一看这是一个同步过程，但是后面可以看到ZMQ允许完成异步的Request-Reply.使用这种简单的通信模型我们可以很快地写出一个echo服务。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">client.cc.send 'hello' always to server,which hosts on localhost:19870</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;zmq.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;unistd.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=zmq_init(1);
    printf(<span class="org-string">"connect to server 'localhost:19870'\n"</span>);
    <span class="org-type">void</span>* <span class="org-variable-name">req</span>=zmq_socket(ctx,ZMQ_REQ);
    zmq_connect(req,<span class="org-string">"tcp://localhost:19870"</span>);
    <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>=0; i&lt;10; i++) {
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">request</span>;
        zmq_msg_init_size(&amp;request,6);
        <span class="org-comment-delimiter">//</span><span class="org-comment">including trailing '\0'.</span>
        memcpy(zmq_msg_data(&amp;request),<span class="org-string">"hello"</span>,6);
        printf(<span class="org-string">"[C]send 'hello'\n"</span>);
        <span class="org-comment-delimiter">// </span><span class="org-comment">0 means in block way.</span>
        zmq_send(req,&amp;request,0);
        zmq_msg_close(&amp;request);
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">reply</span>;
        zmq_msg_init(&amp;reply);
        <span class="org-comment-delimiter">// </span><span class="org-comment">0 means in block way.</span>
        zmq_recv(req,&amp;reply,0);
        printf(<span class="org-string">"[C]recv '%s'\n"</span>,zmq_msg_data(&amp;reply));
        zmq_msg_close(&amp;reply);
    }
    zmq_close(req);
    zmq_term(ctx);
    <span class="org-keyword">return</span> 0;
}

<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">server.cc which hosts on *:19870</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;zmq.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;unistd.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=zmq_init(1);
    printf(<span class="org-string">"bind to '*:19870'\n"</span>);
    <span class="org-type">void</span>* <span class="org-variable-name">rep</span>=zmq_socket(ctx,ZMQ_REP);
    zmq_bind(rep,<span class="org-string">"tcp://*:19870"</span>);
    <span class="org-keyword">while</span>(1){
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">request</span>;
        zmq_msg_init(&amp;request);
        <span class="org-comment-delimiter">// </span><span class="org-comment">0 means in block way</span>
        zmq_recv(rep,&amp;request,0);
        <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">s</span>=(<span class="org-keyword">const</span> <span class="org-type">char</span>*)zmq_msg_data(&amp;request);
        printf(<span class="org-string">"[S]recv '%s'\n"</span>,s);
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">reply</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">include trailing '\0'.</span>
        zmq_msg_init_size(&amp;reply,strlen(s)+1);
        memcpy(zmq_msg_data(&amp;reply),s,strlen(s)+1);
        zmq_msg_close(&amp;request);
        <span class="org-comment-delimiter">// </span><span class="org-comment">0 means in block way.</span>
        printf(<span class="org-string">"[S]send '%s'\n"</span>,s);
        zmq_send(rep,&amp;reply,0);
        zmq_msg_close(&amp;reply);
    }
    zmq_close(rep);
    zmq_term(ctx);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
<p>
从编写角度来看的话确实简化了不少
</p>
<ul class="org-ul">
<li>zmq_init创建一个context.这个context就可以认为是一个MQ实例。1表示IO线程数。
</li>
<li>zmq_socket根据context来创建一个socket,后面类型指定了MQ通信类型。
</li>
<li>zmq_bind/zmq_connect可以进行绑定进行监听或者是进行连接。
</li>
<li>zmq_msg_init/zmq_msg_init_size可以用来初始化一个message
</li>
<li>zmq_send/zmq_recv可以进行message的发送和接收。
</li>
<li>zmq_msg_close销毁一个message
</li>
<li>zmq_close关闭一个socket
</li>
<li>zmq_term销毁一个context
</li>
</ul>

<p>
ZMQ底层做好了poller机制，对于server来说的话将多个connection映射到一个socket上面来了。底层使用其他线程完成了IO读写。
这里可以看到如果使用TCP的话底层应该是字节流，而我们没有指定任何成帧策略就得到了一条条消息，可以看到ZMQ内置有一个字节流成帧策略。
</p>
</div>
</div>
