html/zeromq.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Protocol</h3>
<div class="outline-text-3" id="text-1-2">
<p>
我们从上面的Example里面看到，在进行zmq_bind/zmq_connect的时候指定了通信地址，而通信地址上面还附带了通信协议"tcp".ZMQ本身是允许工作在多种通信协议上面的：
</p>
<ul class="org-ul">
<li>tcp // tcp
</li>
<li>ipc // 进程间通信。猜想底层应该是unix domain socket实现的.因为运行完毕之后我们可以看到socket文件。
</li>
<li>inproc // 线程间通信。对于这种通讯协议来说的话底层IO线程没用使用。
</li>
<li>pgm // Pragmatic General Multicast, 实用通用多播协议，基于IP协议的可靠多路广播
</li>
<li>epgm // encapsulated pgm, 可以认为是pgm的变体
</li>
</ul>

<p>
<a href="http://www.cnblogs.com/fengbohello/p/4336261.html">文章</a> 有关于pgm和epgm的简单介绍。实际应用中 `tcp` 协议应该是可以满足很多情况了。
</p>
<blockquote>
<p>
MQ在实现PGM的时候有两种变体，将PGM数据报直接放在IP数据报的上一层的标准协议，在RFC文档3208中定义（pgm传输）；和“封装PGM”或叫EPGM，此时PGM数据报被封装在UDP数据报内部（epgm传输方式）。
</p>

<p>
pgm和epgm传输方式只能被ZMQ_PUB和ZMQ_SUB两种socket使用。
</p>

<p>
默认情况下，PGM的socket的速率是被限制的。参见zmq_setsockopt(3)函数的ZMQ_RATE和ZMQ_RECOVERY_IVL属性以获取更多细节。
</p>

<p>
pgm的实现需要访问原始的IP套接字（socket）。附加的功能可能需要访问操作系统的操作。不需要与其它PGM的实现进行互操作性的应用程序可以使用epgm，这样不需要请求任何特权。
</p>
</blockquote>

<p>
我们可以非常容易地切换到其他通信协议上，而不需要修改任何代码。
</p>
<div class="org-src-container">

<pre class="src src-C++">zmq_connect(req,<span class="org-string">"ipc://fuck"</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">client.cc</span>
zmq_bind(req,<span class="org-string">"ipc://fuck"</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">server.cc</span>
</pre>
</div>

<p>
可以在系统上查看的确有 `fuck` 这个文件。
</p>
<pre class="example">
[zhangyan@tc-cm-et18.tc.baidu.com]$ stat fuck
  File: `fuck'
  Size: 0               Blocks: 0          IO Block: 4096   socket
Device: 803h/2051d      Inode: 133580916   Links: 1
Access: (0755/srwxr-xr-x)  Uid: (  521/zhangyan)   Gid: (  524/zhangyan)
Access: 2011-09-26 14:02:44.000000000 +0800
Modify: 2011-09-26 14:02:44.000000000 +0800
Change: 2011-09-26 14:02:44.000000000 +0800
</pre>
<p>
底层协议本身在使用的时候还有一些特别需要注意的地方，但是差异并不是很大，所以可以认为ZMQ在这个问题上解决还是比较好的。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Message</h3>
<div class="outline-text-3" id="text-1-3">
<p>
我们从上面的Example可以看到，ZMQ内部有一个默认的成帧策略，也就是说我们使用zmq_recv/zmq_send这样写成的webserver是不能够正常工作的，
因为zmq_recv/zmq_send只能够处理内置的消息格式，而不能够处理http请求这种字节流，按照文档的说法"ZMQ is not a neutral carrier".
</p>

<p>
There is however a good answer to the question, "how can I make profitable use of ZMQ when making my new XYZ server?" You need to implement whatever protocol you want to speak in any case, but you can connect that protocol server (which can be extremely thin) to a ZMQ backend that does the real work. The beautiful part here is that you can then extend your backend with code in any language, running locally or remotely, as you wish. Zed Shaw's Mongrel2 web server is a great example of such an architecture.
</p>

<p>
ZMQ的消息格式是这样的
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">struct</span> <span class="org-type">msg</span>{
    <span class="org-type">msg_size_t</span> <span class="org-variable-name">size</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#20294;&#26159;&#20026;&#20102;&#25928;&#29575;&#30340;&#35805;&#20250;&#20351;&#29992;&#29305;&#27530;&#30340;&#26041;&#27861;&#36827;&#34892;&#21387;&#32553;</span>
    <span class="org-type">msg_data_t</span> <span class="org-variable-name">data</span>[0];
};
</pre>
</div>

<p>
ZMQ允许一条message按照多个部分进行发送(multipart message),为了能够更好地描述这节的话我们重新定义一些名词。
后面我们可能会混用这两个名词，但是读者应该是可以区分的：
</p>
<ul class="org-ul">
<li>frame.single part message.
</li>
<li>message.多个frame组成的一条完整message.
</li>
</ul>
<p>
我们使用下面的例子来说明如何进行multipart message传输和接收的。multipart message对于理解后面的路由非常重要。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">//  </span><span class="org-comment">Convert C string to ZMQ string and send to socket</span>
<span class="org-keyword">static</span> <span class="org-type">int</span>
<span class="org-function-name">s_send</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-type">char</span> *<span class="org-variable-name">string</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">rc</span>;
    <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">message</span>;
    zmq_msg_init_size (&amp;message, strlen (string));
    memcpy (zmq_msg_data (&amp;message), string, strlen (string));
    rc = zmq_send (socket, &amp;message, 0);
    zmq_msg_close (&amp;message);
    <span class="org-keyword">return</span> (rc);
}

<span class="org-comment-delimiter">//  </span><span class="org-comment">Sends string as ZMQ string, as multipart non-terminal</span>
<span class="org-keyword">static</span> <span class="org-type">int</span>
<span class="org-function-name">s_sendmore</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-type">char</span> *<span class="org-variable-name">string</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">rc</span>;
    <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">message</span>;
    zmq_msg_init_size (&amp;message, strlen (string));
    memcpy (zmq_msg_data (&amp;message), string, strlen (string));
    rc = zmq_send (socket, &amp;message, ZMQ_SNDMORE);
    zmq_msg_close (&amp;message);
    <span class="org-keyword">return</span> (rc);
}

<span class="org-comment-delimiter">//  </span><span class="org-comment">Receives all message parts from socket, prints neatly</span>
<span class="org-comment-delimiter">//</span>
<span class="org-keyword">static</span> <span class="org-type">void</span>
<span class="org-function-name">s_dump</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>)
{
    puts (<span class="org-string">"----------------------------------------"</span>);
    <span class="org-keyword">while</span> (1) {
        <span class="org-comment-delimiter">//  </span><span class="org-comment">Process all parts of the message</span>
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">message</span>;
        zmq_msg_init (&amp;message);
        zmq_recv (socket, &amp;message, 0);

        <span class="org-comment-delimiter">//  </span><span class="org-comment">Dump the message as text or binary</span>
        <span class="org-type">char</span> *<span class="org-variable-name">data</span> = (<span class="org-type">char</span>*) zmq_msg_data (&amp;message);
        <span class="org-type">int</span> <span class="org-variable-name">size</span> = zmq_msg_size (&amp;message);
        <span class="org-type">int</span> <span class="org-variable-name">is_text</span> = 1;
        <span class="org-type">int</span> <span class="org-variable-name">char_nbr</span>;
        <span class="org-keyword">for</span> (char_nbr = 0; char_nbr &lt; size; char_nbr++)
            <span class="org-keyword">if</span> ((<span class="org-type">unsigned</span> <span class="org-type">char</span>) data [char_nbr] &lt; 32
            ||  (<span class="org-type">unsigned</span> <span class="org-type">char</span>) data [char_nbr] &gt; 127)
                is_text = 0;

        printf (<span class="org-string">"[%03d] "</span>, size);
        <span class="org-keyword">for</span> (char_nbr = 0; char_nbr &lt; size; char_nbr++) {
            <span class="org-keyword">if</span> (is_text)
                printf (<span class="org-string">"%c"</span>, data [char_nbr]);
            <span class="org-keyword">else</span>
                printf (<span class="org-string">"%02X"</span>, (<span class="org-type">unsigned</span> <span class="org-type">char</span>) data [char_nbr]);
        }
        printf (<span class="org-string">"\n"</span>);

        <span class="org-type">int64_t</span> <span class="org-variable-name">more</span>;           <span class="org-comment-delimiter">//  </span><span class="org-comment">Multipart detection</span>
        <span class="org-type">size_t</span> <span class="org-variable-name">more_size</span> = <span class="org-keyword">sizeof</span> (more);
        zmq_getsockopt (socket, ZMQ_RCVMORE, &amp;more, &amp;more_size);
        zmq_msg_close (&amp;message);
        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>more)
            <span class="org-keyword">break</span>;      <span class="org-comment-delimiter">//  </span><span class="org-comment">Last message part</span>
    }
}
</pre>
</div>

<p>
如果使用ZMQ出现消息丢失的话，那么可以按照下面这个solver来查找原因 <a href="http://zguide.zeromq.org/page:all#Missing-Message-Problem-Solver">http://zguide.zeromq.org/page:all#Missing-Message-Problem-Solver</a> .
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Identity</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Identity可以用来表示一个socket的身份，对于ZMQ是非常有用途的，现在能够总结到的作用有下面这些：
</p>
<ul class="org-ul">
<li>持久化socket(durable socket).影响到Publish-Subscribe通信模型的可靠性。
</li>
<li>路由(routing).影响到ROUTER的路由选择。
</li>
</ul>
<p>
关于Identity似乎如何影响到上面两个方面的，我们会在后面的各个小节仔细描述。我们看看如何设置Identity的。
</p>
<div class="org-src-container">

<pre class="src src-C++">zmq_setsockopt(socket,ZMQ_IDENTITY,<span class="org-string">"dirlt"</span>,5);
</pre>
</div>

<p>
如果没有设置Identity的话，那么在pub-sub模型上的话就会出现消息丢失，而在路由的时候那么ROUTER会帮助用户生成UUID.
Identity的实现非常简单，就是整个message开头加上一个特殊的frame来标记的。
</p>
</div>
</div>
