html/zeromq.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Device</h3>
<div class="outline-text-3" id="text-1-5">
<p>
一旦通信节点超过一定数量的话，那么最好需要一个转发节点或者是中间节点，不然通信费用以及管理复杂度都会急剧上升。作为一个转发节点来说的话，
逻辑非常简单，从一个socket读取数据，然后向另外一个socket里面写数据，可以认为类似于pipe这样的机制。在ZMQ里面称这样的节点为Device.
ZMQ里面内置的Device有下面三种：
</p>
<ul class="org-ul">
<li>QUEUE, which is like the request-reply broker. <a href="http://zguide.zeromq.org/page:all#A-Request-Reply-Broker">http://zguide.zeromq.org/page:all#A-Request-Reply-Broker</a> .
</li>
<li>FORWARDER, which is like the pub-sub proxy server. <a href="http://zguide.zeromq.org/page:all#A-Publish-Subscribe-Proxy-Server">http://zguide.zeromq.org/page:all#A-Publish-Subscribe-Proxy-Server</a> .
</li>
<li>STREAMER, which is like FORWARDER but for pipeline flows.
</li>
</ul>

<p>
使用device也非常简单。下面是段示例代码
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">"zhelpers.h"</span>
<span class="org-type">int</span> <span class="org-function-name">main</span> (<span class="org-type">void</span>)
{
    <span class="org-type">void</span> *<span class="org-variable-name">context</span> = zmq_init (1);

    <span class="org-comment-delimiter">// </span><span class="org-comment">Socket facing clients</span>
    <span class="org-type">void</span> *<span class="org-variable-name">frontend</span> = zmq_socket (context, ZMQ_ROUTER);
    zmq_bind (frontend, <span class="org-string">"tcp://*:5559"</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">Socket facing services</span>
    <span class="org-type">void</span> *<span class="org-variable-name">backend</span> = zmq_socket (context, ZMQ_DEALER);
    zmq_bind (backend, <span class="org-string">"tcp://*:5560"</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">Start built-in device</span>
    zmq_device (ZMQ_QUEUE, frontend, backend);

    <span class="org-comment-delimiter">// </span><span class="org-comment">We never get here&#8230;</span>
    zmq_close (frontend);
    zmq_close (backend);
    zmq_term (context);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
ZMQ Guide里面提到了不要将不同Device和socket进行混用. If you're like most 01MQ users, at this stage your mind is starting to think, "what kind of evil stuff can I do if I plug random socket types into devices?" The short answer is: don't do it. You can mix socket types but the results are going to be weird. So stick to using ROUTER/DEALER for queue devices, SUB/PUB for forwarders and PULL/PUSH for streamers. 如果实际阅读代码的话，会发现这个部分的逻辑都是一样的，也就是事实上在现在ZMQ版本里面是可以混用的。用户在使用的时候需要注意好模式的搭配。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">int</span> <span class="org-function-name">zmq_device</span> (<span class="org-type">int</span> <span class="org-variable-name">device_</span>, <span class="org-type">void</span> *<span class="org-variable-name">insocket_</span>, <span class="org-type">void</span> *<span class="org-variable-name">outsocket_</span>)
{
    <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>insocket_ || <span class="org-negation-char">!</span>outsocket_) {
        errno = EFAULT;
        <span class="org-keyword">return</span> -1;
    }

    <span class="org-keyword">if</span> (device_ != ZMQ_FORWARDER &amp;&amp; device_ != ZMQ_QUEUE &amp;&amp;
          device_ != ZMQ_STREAMER) {
       errno = EINVAL;
       <span class="org-keyword">return</span> -1;
    }

    <span class="org-keyword">return</span> <span class="org-constant">zmq</span>::device ((<span class="org-constant">zmq</span>::<span class="org-type">socket_base_t</span>*) insocket_,
        (<span class="org-constant">zmq</span>::<span class="org-type">socket_base_t</span>*) outsocket_);
}
</pre>
</div>

<p>
而zmq::device逻辑也非常简单，就是之前提到pipe工作机制。内部使用了ZMQ本身提供的zmq_poll机制来进行通知哪个socket上面有数据。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">int</span> <span class="org-constant">zmq</span>::<span class="org-function-name">device</span> (<span class="org-keyword">class</span> <span class="org-type">socket_base_t</span> *<span class="org-variable-name">insocket_</span>,
        <span class="org-keyword">class</span> <span class="org-type">socket_base_t</span> *<span class="org-variable-name">outsocket_</span>)
{
    <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
    <span class="org-type">int</span> <span class="org-variable-name">rc</span> = zmq_msg_init (&amp;msg);

    <span class="org-keyword">if</span> (rc != 0) {
        <span class="org-keyword">return</span> -1;
    }

    <span class="org-type">int64_t</span> <span class="org-variable-name">more</span>;
    <span class="org-type">size_t</span> <span class="org-variable-name">moresz</span>;

    <span class="org-type">zmq_pollitem_t</span> <span class="org-variable-name">items</span> [2];
    items [0].socket = insocket_;
    items [0].fd = 0;
    items [0].events = ZMQ_POLLIN;
    items [0].revents = 0;
    items [1].socket = outsocket_;
    items [1].fd = 0;
    items [1].events = ZMQ_POLLIN;
    items [1].revents = 0;

    <span class="org-keyword">while</span> (<span class="org-constant">true</span>) {

        <span class="org-comment-delimiter">//  </span><span class="org-comment">Wait while there are either requests or replies to process.</span>
        rc = zmq_poll (&amp;items [0], 2, -1);
        <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
            <span class="org-keyword">return</span> -1;
        }

        <span class="org-comment-delimiter">//  </span><span class="org-comment">The algorithm below asumes ratio of request and replies processed</span>
        <span class="org-comment-delimiter">//  </span><span class="org-comment">under full load to be 1:1. Although processing requests replies</span>
        <span class="org-comment-delimiter">//  </span><span class="org-comment">first is tempting it is suspectible to DoS attacks (overloading</span>
        <span class="org-comment-delimiter">//  </span><span class="org-comment">the system with unsolicited replies).</span>

        <span class="org-comment-delimiter">//  </span><span class="org-comment">Process a request.</span>
        <span class="org-keyword">if</span> (items [0].revents &amp; ZMQ_POLLIN) {
            <span class="org-keyword">while</span> (<span class="org-constant">true</span>) {

                rc = insocket_-&gt;recv (&amp;msg, 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                moresz = <span class="org-keyword">sizeof</span> (more);
                rc = insocket_-&gt;getsockopt (ZMQ_RCVMORE, &amp;more, &amp;moresz);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                rc = outsocket_-&gt;send (&amp;msg, more ? ZMQ_SNDMORE : 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>more)
                    <span class="org-keyword">break</span>;
            }
        }

        <span class="org-comment-delimiter">//  </span><span class="org-comment">Process a reply.</span>
        <span class="org-keyword">if</span> (items [1].revents &amp; ZMQ_POLLIN) {
            <span class="org-keyword">while</span> (<span class="org-constant">true</span>) {

                rc = outsocket_-&gt;recv (&amp;msg, 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                moresz = <span class="org-keyword">sizeof</span> (more);
                rc = outsocket_-&gt;getsockopt (ZMQ_RCVMORE, &amp;more, &amp;moresz);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                rc = insocket_-&gt;send (&amp;msg, more ? ZMQ_SNDMORE : 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>more)
                    <span class="org-keyword">break</span>;
            }
        }

    }

    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
