src/zeromq.org
*** Congestion
ZMQ可以通过控制HWM(high-water mark)来控制拥塞。内部实现上每一个socket有关联了buffer,HWM可以控制buffer大小
- PUB/PUSH有transmit buffers.
- SUB/PULL/REQ/REP有receive buffers.
- DEALER/ROUTER/PAIR有transmit buffers也有receive buffers.
一旦socket达到了high-water mark的话，那么会根据socket类型来决定是丢弃还是block.现在实现而言的话PUB会尝试丢弃数据，而其他类型的socket就会block住。
如果socket是线程之间进行通信的话，那么HWM是两者socket的HWM之和。因为默认HWM是ulimited的，所以只要一端没有设置的话那么容量就无限。

Some notes on using the HWM option:
- This affects both the transmit and receive buffers of a single socket. Some sockets (PUB, PUSH) only have transmit buffers. Some (SUB, PULL, REQ, REP) only have receive buffers. Some (DEALER, ROUTER, PAIR) have both transmit and receive buffers.
- When your socket reaches its high-water mark, it will either block or drop data depending on the socket type. PUB sockets will drop data if they reach their high-water mark, while other socket types will block.
- Over the inproc transport, the sender and reciever share the same buffers, so the real HWM is the sum of the HWM set by both sides. This means in effect that if one side does not set a HWM, there is no limit to the buffer size.

如果我们的内存有限的话那么我们希望将内存swap到磁盘上面。ZMQ允许我们如果拥塞内存超过HWM的话，那么还可以将内存swap到磁盘上面去。
不过这个磁盘内容我们是不可见的，并且不能够进行持久化。如果进程一旦crash重启的话那么内容消失。仅仅是为了swap用的，而不是为了持久化用的。

** Pattern
*** Exclusive-Pair
Exclusive-Pair是最简单的1:1通信模式，你可以认为就是一个TCPConnection.我们依然需要写bind和connect,但是server只能够接受一个连接。
数据可以进行双向连接，没有类似于REQ-REP的lockstep这样的要求。例子中我们连续发送了两个message,然后使用了inproc协议的socket.

#+BEGIN_SRC C++
#include <zmq.h>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <pthread.h>

void* second(void* arg){
    void* ctx=arg;
    void* pair=zmq_socket(ctx,ZMQ_PAIR);
    zmq_connect(pair,"inproc://channel");
    for(int i=0;i<2;i++){
        zmq_msg_t msg;
        zmq_msg_init(&msg);
        zmq_recv(pair,&msg,0);
        printf("[S]recv '%s'\n",zmq_msg_data(&msg));
        zmq_msg_close(&msg);
    }
    for(int i=0;i<2;i++){
        zmq_msg_t msg;
        zmq_msg_init_size(&msg,6);
        memcpy(zmq_msg_data(&msg),"world",6);
        printf("[S]send '%s'\n",zmq_msg_data(&msg));
        zmq_send(pair,&msg,0);
        zmq_msg_close(&msg);
    }
    zmq_close(pair);
}
int main(){
    void* ctx=zmq_init(2);
    void* pair=zmq_socket(ctx,ZMQ_PAIR);
    zmq_bind(pair,"inproc://channel");
    pthread_t id;
    pthread_create(&id,NULL,&second,ctx);
    for(int i=0;i<2;i++){
        zmq_msg_t msg;
        zmq_msg_init_size(&msg,6);
        memcpy(zmq_msg_data(&msg),"world",6);
        printf("[M]send '%s'\n",zmq_msg_data(&msg));
        zmq_send(pair,&msg,0);
        zmq_msg_close(&msg);
    }
    for(int i=0;i<2;i++){
        zmq_msg_t msg;
        zmq_msg_init(&msg);
        zmq_recv(pair,&msg,0);
        printf("[M]recv '%s'\n",zmq_msg_data(&msg));
        zmq_msg_close(&msg);
    }
    pthread_join(id,NULL);
    zmq_close(pair);
    zmq_term(ctx);
    return 0;
}
#+END_SRC

*** Publish-Subscribe
Pub-Sub模式非常简单，Pub不断地发布消息而Sub那么就不断地接收消息。因为消息的流向是单向的，所以相对于来说比较简单。subscriber可以订阅多个publisher,
多个publisher的消息会交替地到达。关于例子的话可以参考 http://zguide.zeromq.org/page:all#Getting-the-Message-Out .

我们在使用的时候subscriber必须设置ZMQ_SUBSCRIBE内容，否则subscriber是接收不到数据的。对于这个内容在进行过滤的时候有用，subscriber会根据消息头进行过滤，
如果消息头不和ZMQ_SUBSCRIBE的内容匹配的话那么数据就会被丢弃。但是从现在的实现上来看的话，现在过滤过程并不是在publisher来完成的，而是在subscriber获得所有数据来进行过滤的。
如果不想进行过滤的话，那么可以将ZMQ_SUBSCRIBE内容设置为空
#+BEGIN_SRC C++
zmq_setsockopt (subscriber, ZMQ_SUBSCRIBE, "", 0);
#+END_SRC

In the current versions of ZMQ, filtering happens at the subscriber side, not the publisher side. This means, over TCP, that a publisher will send all messages to all subscribers, which will then drop messages they don't want.

