html/zeromq.html

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Congestion</h3>
<div class="outline-text-3" id="text-1-6">
<p>
ZMQ可以通过控制HWM(high-water mark)来控制拥塞。内部实现上每一个socket有关联了buffer,HWM可以控制buffer大小
</p>
<ul class="org-ul">
<li>PUB/PUSH有transmit buffers.
</li>
<li>SUB/PULL/REQ/REP有receive buffers.
</li>
<li>DEALER/ROUTER/PAIR有transmit buffers也有receive buffers.
</li>
</ul>
<p>
一旦socket达到了high-water mark的话，那么会根据socket类型来决定是丢弃还是block.现在实现而言的话PUB会尝试丢弃数据，而其他类型的socket就会block住。
如果socket是线程之间进行通信的话，那么HWM是两者socket的HWM之和。因为默认HWM是ulimited的，所以只要一端没有设置的话那么容量就无限。
</p>

<p>
Some notes on using the HWM option:
</p>
<ul class="org-ul">
<li>This affects both the transmit and receive buffers of a single socket. Some sockets (PUB, PUSH) only have transmit buffers. Some (SUB, PULL, REQ, REP) only have receive buffers. Some (DEALER, ROUTER, PAIR) have both transmit and receive buffers.
</li>
<li>When your socket reaches its high-water mark, it will either block or drop data depending on the socket type. PUB sockets will drop data if they reach their high-water mark, while other socket types will block.
</li>
<li>Over the inproc transport, the sender and reciever share the same buffers, so the real HWM is the sum of the HWM set by both sides. This means in effect that if one side does not set a HWM, there is no limit to the buffer size.
</li>
</ul>

<p>
如果我们的内存有限的话那么我们希望将内存swap到磁盘上面。ZMQ允许我们如果拥塞内存超过HWM的话，那么还可以将内存swap到磁盘上面去。
不过这个磁盘内容我们是不可见的，并且不能够进行持久化。如果进程一旦crash重启的话那么内容消失。仅仅是为了swap用的，而不是为了持久化用的。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Pattern</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Exclusive-Pair</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Exclusive-Pair是最简单的1:1通信模式，你可以认为就是一个TCPConnection.我们依然需要写bind和connect,但是server只能够接受一个连接。
数据可以进行双向连接，没有类似于REQ-REP的lockstep这样的要求。例子中我们连续发送了两个message,然后使用了inproc协议的socket.
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;zmq.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstdio&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstdlib&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstring&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;pthread.h&gt;</span>

<span class="org-type">void</span>* <span class="org-function-name">second</span>(<span class="org-type">void</span>* <span class="org-variable-name">arg</span>){
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=arg;
    <span class="org-type">void</span>* <span class="org-variable-name">pair</span>=zmq_socket(ctx,ZMQ_PAIR);
    zmq_connect(pair,<span class="org-string">"inproc://channel"</span>);
    <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>=0;i&lt;2;i++){
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
        zmq_msg_init(&amp;msg);
        zmq_recv(pair,&amp;msg,0);
        printf(<span class="org-string">"[S]recv '%s'\n"</span>,zmq_msg_data(&amp;msg));
        zmq_msg_close(&amp;msg);
    }
    <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>=0;i&lt;2;i++){
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
        zmq_msg_init_size(&amp;msg,6);
        memcpy(zmq_msg_data(&amp;msg),<span class="org-string">"world"</span>,6);
        printf(<span class="org-string">"[S]send '%s'\n"</span>,zmq_msg_data(&amp;msg));
        zmq_send(pair,&amp;msg,0);
        zmq_msg_close(&amp;msg);
    }
    zmq_close(pair);
}
<span class="org-type">int</span> <span class="org-function-name">main</span>(){
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=zmq_init(2);
    <span class="org-type">void</span>* <span class="org-variable-name">pair</span>=zmq_socket(ctx,ZMQ_PAIR);
    zmq_bind(pair,<span class="org-string">"inproc://channel"</span>);
    <span class="org-type">pthread_t</span> <span class="org-variable-name">id</span>;
    pthread_create(&amp;id,<span class="org-constant">NULL</span>,&amp;second,ctx);
    <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>=0;i&lt;2;i++){
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
        zmq_msg_init_size(&amp;msg,6);
        memcpy(zmq_msg_data(&amp;msg),<span class="org-string">"world"</span>,6);
        printf(<span class="org-string">"[M]send '%s'\n"</span>,zmq_msg_data(&amp;msg));
        zmq_send(pair,&amp;msg,0);
        zmq_msg_close(&amp;msg);
    }
    <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>=0;i&lt;2;i++){
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
        zmq_msg_init(&amp;msg);
        zmq_recv(pair,&amp;msg,0);
        printf(<span class="org-string">"[M]recv '%s'\n"</span>,zmq_msg_data(&amp;msg));
        zmq_msg_close(&amp;msg);
    }
    pthread_join(id,<span class="org-constant">NULL</span>);
    zmq_close(pair);
    zmq_term(ctx);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Publish-Subscribe</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Pub-Sub模式非常简单，Pub不断地发布消息而Sub那么就不断地接收消息。因为消息的流向是单向的，所以相对于来说比较简单。subscriber可以订阅多个publisher,
多个publisher的消息会交替地到达。关于例子的话可以参考 <a href="http://zguide.zeromq.org/page:all#Getting-the-Message-Out">http://zguide.zeromq.org/page:all#Getting-the-Message-Out</a> .
</p>

<p>
我们在使用的时候subscriber必须设置ZMQ_SUBSCRIBE内容，否则subscriber是接收不到数据的。对于这个内容在进行过滤的时候有用，subscriber会根据消息头进行过滤，
如果消息头不和ZMQ_SUBSCRIBE的内容匹配的话那么数据就会被丢弃。但是从现在的实现上来看的话，现在过滤过程并不是在publisher来完成的，而是在subscriber获得所有数据来进行过滤的。
如果不想进行过滤的话，那么可以将ZMQ_SUBSCRIBE内容设置为空
</p>
<div class="org-src-container">

<pre class="src src-C++">zmq_setsockopt (subscriber, ZMQ_SUBSCRIBE, <span class="org-string">""</span>, 0);
</pre>
</div>

<p>
In the current versions of ZMQ, filtering happens at the subscriber side, not the publisher side. This means, over TCP, that a publisher will send all messages to all subscribers, which will then drop messages they don't want.
</p>
</div>
