src/zeromq.org
**** Missing Message
我们看下面一个例子.为了简单起见我们想让subscriber首先运行起来，然后让publisher运行起来。因为如果我们首先将publisher连接起来的话，
那么subscriber在进行连接的话就会丢失很多记录了。

#+BEGIN_SRC C++
//============================================================
// publisher.cc,faster speed.
//============================================================
#include "zhelpers.h"

int main(){
    void* ctx=zmq_init(1);
    void* pub=zmq_socket(ctx,ZMQ_PUB);
    zmq_bind(pub,"tcp://*:19870");
    const int header=10001;
    for(int i=0;i<10;i++){
        char message[20];
        snprintf(message,sizeof(message),"%d %d",header,i);
        printf("send '%s'\n",message);
        {
            zmq_msg_t msg;
            zmq_msg_init_size(&msg,strlen(message)+1);
            memcpy(zmq_msg_data(&msg),message,strlen(message)+1);
            zmq_send(pub,&msg,0);
            zmq_msg_close(&msg);
            sleep(1);
        }
    }
    zmq_close(pub);
    zmq_term(ctx);
    return 0;
}

//============================================================
// subscriber.cc,litte speed.
//============================================================
#include "zhelpers.h"

int main(){
    void* ctx=zmq_init(1);
    void* sub=zmq_socket(ctx,ZMQ_SUB);
    zmq_setsockopt(sub,ZMQ_SUBSCRIBE,"10001",5);
    zmq_connect(sub,"tcp://localhost:19870");
    for(int i=0;i<10;i++){
        zmq_msg_t msg;
        zmq_msg_init(&msg);
        zmq_recv(sub,&msg,0);
        printf("recv '%s'\n",zmq_msg_data(&msg));
        zmq_msg_close(&msg);
        sleep(1);
    }
    zmq_close(sub);
    zmq_term(ctx);
    return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
[zhangyan@tc-cm-et18.tc.baidu.com]$ ./publisher
send '10001 0'
send '10001 1'
send '10001 2'
send '10001 3'
send '10001 4'
send '10001 5'
send '10001 6'
send '10001 7'
send '10001 8'
send '10001 9'

[zhangyan@tc-cm-et18.tc.baidu.com]$ ./subscriber
recv '10001 1'
recv '10001 2'
recv '10001 3'
recv '10001 4'
recv '10001 5'
recv '10001 6'
recv '10001 7'
recv '10001 8'
recv '10001 9'
#+END_EXAMPLE
我们看到的是subscriber丢失了一条消息。这个非常好解释，那就是说虽然subsriber首先启动的话，但是只有当publisher启动之后发送了一条信息之后才能够感知到对端启动，
这个时候subscriber再进行连接，那么就造成第一条数据的丢失。(这个过程是我猜测的，但是关于这个现象在ZMQ Guide上面是有解释的)

There is one important thing to know about PUB-SUB sockets: you do not know precisely when a subscriber starts to get messages. Even if you start a subscriber, wait a while, and then start the publisher, the subscriber will always miss the first messages that the publisher sends. This is because as the subscriber connects to the publisher (something that takes a small but non-zero time), the publisher may already be sending messages out.

解决这个问题很简单，就是需要一个同步的机制。但是即使是 http://zguide.zeromq.org/page:all#Node-Coordination 这种同步机制也是不够的。robust的同步机制应该是
A more robust model could be:
- Publisher opens PUB socket and starts sending "Hello" messages (not data).
- Subscribers connect SUB socket and when they receive a Hello message they tell the publisher via a REQ/REP socket pair.
- When the publisher has had all the necessary confirmations, it starts to send real data.

**** Congestion Control
之前我们提到拥塞控制，对于PUB来说的话如果达到了HWM的话那么会直接进行丢弃。我们简单地修改一下上面的代码，让subscriber连接上但是不进行处理，而publisher不断地发送消息。
#+BEGIN_SRC C++
//============================================================
// publisher.cc,faster speed.
//============================================================
#include "zhelpers.h"

int main(){
    void* ctx=zmq_init(1);
    void* pub=zmq_socket(ctx,ZMQ_PUB);
    zmq_bind(pub,"tcp://*:19870");
    const int header=10001;
    int i=0;
    while(1){
        i++;
        char message[20];
        snprintf(message,sizeof(message),"%d %d",header,i);
        printf("send '%s'\n",message);
        {
            zmq_msg_t msg;
            zmq_msg_init_size(&msg,strlen(message)+1);
            memcpy(zmq_msg_data(&msg),message,strlen(message)+1);
            zmq_send(pub,&msg,0);
            zmq_msg_close(&msg);
        }
    }
    zmq_close(pub);
    zmq_term(ctx);
    return 0;
}

//============================================================
// subscriber.cc,litte speed.
//============================================================
#include "zhelpers.h"

int main(){
    void* ctx=zmq_init(1);
    void* sub=zmq_socket(ctx,ZMQ_SUB);
    zmq_setsockopt(sub,ZMQ_SUBSCRIBE,"10001",5);
    zmq_connect(sub,"tcp://localhost:19870");
    sleep(100000);
    zmq_close(sub);
    zmq_term(ctx);
    return 0;
}

#+END_SRC
然后我们看看运行之后的效果是subscriber占用的内存越来越大，而publisher的内存稳定。这是因为subscriber一旦连接上之后，那么publisher的内容就可以推送给
subscriber在sub这端进行缓存。如果一旦disconnect掉subscriber的话，因为publisher没有订阅者，那么消息直接丢弃不会在pub这端缓存。

我们可以通过设置Identity来强迫publisher进行缓存，在subscriber.cc部分加上
#+BEGIN_SRC C++
zmq_setsockopt(sub,ZMQ_IDENTITY,"luck",4);
#+END_SRC
然后启动subscriber然后挂断，因为subscriber连接上之后告诉了publisher自己的identity,那么publisher就会尝试缓存所有没有发往这个subscriber的数据。
如果没有设置PUB的HWM的话，那么PUB的内存很快就会被耗光。如果我们设置了HWM的话，那么publisher仅仅会缓存部分数据。我们还可以通过设置SWAP大小，
将部分拥塞部分结果放在磁盘上面，如果拥塞结果消息数量超过HWM的话
#+BEGIN_SRC C++
uint64_t hwm = 2;
zmq_setsockopt (publisher, ZMQ_HWM, &hwm, sizeof (hwm));

// Specify swap space in bytes
uint64_t swap = 25000000;
zmq_setsockopt (publisher, ZMQ_SWAP, &swap, sizeof (swap));
#+END_SRC

*** Push-Pull
Push-Pull相对于Pub-Sub模式更加简单。Push-Pull模型工作方式是Divide-And-Conquer，会保证选择一个并且只有一个client来处理消息，而不像Pub-Sub一样会尝试让所有的client都获得消息。
关于例子的话可以直接参考链接 http://zguide.zeromq.org/page:all#Divide-and-Conquer . 对于ZMQ的Push-Pull实现的话，server端会不断地发现新增的client连接，然后再进行消息分发的时候，
也会将这些消息分发到新增加的client上面去，使用这个功能的话就可以非常方便地处理动态添加机器的行为。

