html/zeromq.html

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Missing Message</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
我们看下面一个例子.为了简单起见我们想让subscriber首先运行起来，然后让publisher运行起来。因为如果我们首先将publisher连接起来的话，
那么subscriber在进行连接的话就会丢失很多记录了。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">publisher.cc,faster speed.</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"zhelpers.h"</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(){
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=zmq_init(1);
    <span class="org-type">void</span>* <span class="org-variable-name">pub</span>=zmq_socket(ctx,ZMQ_PUB);
    zmq_bind(pub,<span class="org-string">"tcp://*:19870"</span>);
    <span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">header</span>=10001;
    <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>=0;i&lt;10;i++){
        <span class="org-type">char</span> <span class="org-variable-name">message</span>[20];
        snprintf(message,<span class="org-keyword">sizeof</span>(message),<span class="org-string">"%d %d"</span>,header,i);
        printf(<span class="org-string">"send '%s'\n"</span>,message);
        {
            <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
            zmq_msg_init_size(&amp;msg,strlen(message)+1);
            memcpy(zmq_msg_data(&amp;msg),message,strlen(message)+1);
            zmq_send(pub,&amp;msg,0);
            zmq_msg_close(&amp;msg);
            sleep(1);
        }
    }
    zmq_close(pub);
    zmq_term(ctx);
    <span class="org-keyword">return</span> 0;
}

<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">subscriber.cc,litte speed.</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"zhelpers.h"</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(){
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=zmq_init(1);
    <span class="org-type">void</span>* <span class="org-variable-name">sub</span>=zmq_socket(ctx,ZMQ_SUB);
    zmq_setsockopt(sub,ZMQ_SUBSCRIBE,<span class="org-string">"10001"</span>,5);
    zmq_connect(sub,<span class="org-string">"tcp://localhost:19870"</span>);
    <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>=0;i&lt;10;i++){
        <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
        zmq_msg_init(&amp;msg);
        zmq_recv(sub,&amp;msg,0);
        printf(<span class="org-string">"recv '%s'\n"</span>,zmq_msg_data(&amp;msg));
        zmq_msg_close(&amp;msg);
        sleep(1);
    }
    zmq_close(sub);
    zmq_term(ctx);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<pre class="example">
[zhangyan@tc-cm-et18.tc.baidu.com]$ ./publisher
send '10001 0'
send '10001 1'
send '10001 2'
send '10001 3'
send '10001 4'
send '10001 5'
send '10001 6'
send '10001 7'
send '10001 8'
send '10001 9'

[zhangyan@tc-cm-et18.tc.baidu.com]$ ./subscriber
recv '10001 1'
recv '10001 2'
recv '10001 3'
recv '10001 4'
recv '10001 5'
recv '10001 6'
recv '10001 7'
recv '10001 8'
recv '10001 9'
</pre>
<p>
我们看到的是subscriber丢失了一条消息。这个非常好解释，那就是说虽然subsriber首先启动的话，但是只有当publisher启动之后发送了一条信息之后才能够感知到对端启动，
这个时候subscriber再进行连接，那么就造成第一条数据的丢失。(这个过程是我猜测的，但是关于这个现象在ZMQ Guide上面是有解释的)
</p>

<p>
There is one important thing to know about PUB-SUB sockets: you do not know precisely when a subscriber starts to get messages. Even if you start a subscriber, wait a while, and then start the publisher, the subscriber will always miss the first messages that the publisher sends. This is because as the subscriber connects to the publisher (something that takes a small but non-zero time), the publisher may already be sending messages out.
</p>

<p>
解决这个问题很简单，就是需要一个同步的机制。但是即使是 <a href="http://zguide.zeromq.org/page:all#Node-Coordination">http://zguide.zeromq.org/page:all#Node-Coordination</a> 这种同步机制也是不够的。robust的同步机制应该是
A more robust model could be:
</p>
<ul class="org-ul">
<li>Publisher opens PUB socket and starts sending "Hello" messages (not data).
</li>
<li>Subscribers connect SUB socket and when they receive a Hello message they tell the publisher via a REQ/REP socket pair.
</li>
<li>When the publisher has had all the necessary confirmations, it starts to send real data.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Congestion Control</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
之前我们提到拥塞控制，对于PUB来说的话如果达到了HWM的话那么会直接进行丢弃。我们简单地修改一下上面的代码，让subscriber连接上但是不进行处理，而publisher不断地发送消息。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">publisher.cc,faster speed.</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"zhelpers.h"</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(){
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=zmq_init(1);
    <span class="org-type">void</span>* <span class="org-variable-name">pub</span>=zmq_socket(ctx,ZMQ_PUB);
    zmq_bind(pub,<span class="org-string">"tcp://*:19870"</span>);
    <span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">header</span>=10001;
    <span class="org-type">int</span> <span class="org-variable-name">i</span>=0;
    <span class="org-keyword">while</span>(1){
        i++;
        <span class="org-type">char</span> <span class="org-variable-name">message</span>[20];
        snprintf(message,<span class="org-keyword">sizeof</span>(message),<span class="org-string">"%d %d"</span>,header,i);
        printf(<span class="org-string">"send '%s'\n"</span>,message);
        {
            <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
            zmq_msg_init_size(&amp;msg,strlen(message)+1);
            memcpy(zmq_msg_data(&amp;msg),message,strlen(message)+1);
            zmq_send(pub,&amp;msg,0);
            zmq_msg_close(&amp;msg);
        }
    }
    zmq_close(pub);
    zmq_term(ctx);
    <span class="org-keyword">return</span> 0;
}

<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">subscriber.cc,litte speed.</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">============================================================</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"zhelpers.h"</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(){
    <span class="org-type">void</span>* <span class="org-variable-name">ctx</span>=zmq_init(1);
    <span class="org-type">void</span>* <span class="org-variable-name">sub</span>=zmq_socket(ctx,ZMQ_SUB);
    zmq_setsockopt(sub,ZMQ_SUBSCRIBE,<span class="org-string">"10001"</span>,5);
    zmq_connect(sub,<span class="org-string">"tcp://localhost:19870"</span>);
    sleep(100000);
    zmq_close(sub);
    zmq_term(ctx);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
<p>
然后我们看看运行之后的效果是subscriber占用的内存越来越大，而publisher的内存稳定。这是因为subscriber一旦连接上之后，那么publisher的内容就可以推送给
subscriber在sub这端进行缓存。如果一旦disconnect掉subscriber的话，因为publisher没有订阅者，那么消息直接丢弃不会在pub这端缓存。
</p>

<p>
我们可以通过设置Identity来强迫publisher进行缓存，在subscriber.cc部分加上
</p>
<div class="org-src-container">

<pre class="src src-C++">zmq_setsockopt(sub,ZMQ_IDENTITY,<span class="org-string">"luck"</span>,4);
</pre>
</div>
<p>
然后启动subscriber然后挂断，因为subscriber连接上之后告诉了publisher自己的identity,那么publisher就会尝试缓存所有没有发往这个subscriber的数据。
如果没有设置PUB的HWM的话，那么PUB的内存很快就会被耗光。如果我们设置了HWM的话，那么publisher仅仅会缓存部分数据。我们还可以通过设置SWAP大小，
将部分拥塞部分结果放在磁盘上面，如果拥塞结果消息数量超过HWM的话
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">uint64_t</span> <span class="org-variable-name">hwm</span> = 2;
zmq_setsockopt (publisher, ZMQ_HWM, &amp;hwm, <span class="org-keyword">sizeof</span> (hwm));

<span class="org-comment-delimiter">// </span><span class="org-comment">Specify swap space in bytes</span>
<span class="org-type">uint64_t</span> <span class="org-variable-name">swap</span> = 25000000;
zmq_setsockopt (publisher, ZMQ_SWAP, &amp;swap, <span class="org-keyword">sizeof</span> (swap));
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Push-Pull</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Push-Pull相对于Pub-Sub模式更加简单。Push-Pull模型工作方式是Divide-And-Conquer，会保证选择一个并且只有一个client来处理消息，而不像Pub-Sub一样会尝试让所有的client都获得消息。
关于例子的话可以直接参考链接 <a href="http://zguide.zeromq.org/page:all#Divide-and-Conquer">http://zguide.zeromq.org/page:all#Divide-and-Conquer</a> . 对于ZMQ的Push-Pull实现的话，server端会不断地发现新增的client连接，然后再进行消息分发的时候，
也会将这些消息分发到新增加的client上面去，使用这个功能的话就可以非常方便地处理动态添加机器的行为。
</p>
</div>
</div>
