src/zeromq.org
*** Request-Reply
我们返回来再看Example.在Example里面的话虽然server可以维护很多连接，但是读写方式是同步的，但是ZMQ是提供了异步的Request-Reply的通信模型的。
这节我们主要看看异步的Request-Reply在ZMQ里面是如何做到的。

首先ZMQ还定义了两个socket类型分别是：
- ROUTER(XREP)
- DEALER(XREQ)
其中ROUTER的大致功能是进行路由转发的，不要求立刻进行reply.而DEALER功能类似于PULL+PUSH,如果进行PUSH操作的话能够将消息进行负载均衡，而如果是PULL的话那么能够进行fair-queue能够均匀地将多个后端数据收集过来，然后配合REQ,REP就可以构造出很多种通信模式了。ZMQ Guide总结了一下各个socket类型特点。里面提到了Envelope会在后面说明。

Here now is a more detailed explanation of the four socket types we use for request-reply patterns:
- DEALER just load-balances (deals out) the messages you send to all connected peers, and fair-queues (deals in) the messages it receives. It is exactly like a PUSH and PULL socket combined.
- REQ prepends an empty message part to every message you send, and removes the empty message part from each message you receive. It then works like DEALER (and in fact is built on DEALER) except it also imposes a strict send / receive cycle.
- ROUTER prepends an envelope with reply address to each message it receives, before passing it to the application. It also chops off the envelope (the first message part) from each message it sends, and uses that reply address to decide which peer the message should go to.
- REP stores all the message parts up to the first empty message part, when you receive a message and it passes the rest (the data) to your application. When you send a reply, REP prepends the saved envelopes to the message and sends it back using the same semantics as ROUTER (and in fact REP is built on top of ROUTER), but matching REQ, imposes a strict receive / send cycle.

我们需要深入了解Envelope的机制才能够充分利用ZMQ的灵活性。首先我们看看一个使用ROUTER/DEALER的例子 http://zguide.zeromq.org/page:all#Multithreading-with-MQ .
仔细阅读完成这个例子之后会有一个疑问，就是底层是怎么我们回复的消息应该是和哪一个链接绑定的呢？因为在worker_routine里面的话，我们只是往ZMQ_REP socket里面写信息，
这个信息最终会传回给DEALER,然后DEALER通过device交回给ROUTER,那么ROUTER需要将这个信息传回给client.所有的秘密就在于Message Envelope(信息包装).

关于Envelope可以仔细阅读这个章节 http://zguide.zeromq.org/page:all#Request-Reply-Envelopes . 但是为了方便我们理解，这里我们还是重述一遍。
从上节的介绍中我们看到了REQ/REP的Envelope就是一个empty message part.而对于DEALER来说的话没有处理任何Envelope的信息。ROUTER的Envelope是这样的：
- 如果对端设置了identity的话，每发送一个消息的话ROUTER接收到，那么ROUTER在转发之前会在头部自动加上一个message part,内容是identity.
- 如果对端没有设置identity的话，每发送一个消息的话ROUTER接收到，那么ROUTER在转发之前会生成一个UUID,同样自动加上一个message part,内容是UUID.
如果消息流经多个ROUTER的话，那么会自动加上多个这样的东西。不过下面的实验证明，并不是每个消息都会生成UUID的，而是针对每个连接生成UUID.
#+BEGIN_SRC C++
#include "zhelpers.h"

int main (void) {
    void *context = zmq_init (1);

    void *sink = zmq_socket (context, ZMQ_ROUTER);
    zmq_bind (sink, "inproc://example");

    // First allow 0MQ to set the identity
    void *anonymous = zmq_socket (context, ZMQ_DEALER);
    zmq_connect (anonymous, "inproc://example");
    s_send (anonymous, "ROUTER uses a generated UUID");
    s_dump (sink);
    s_send (anonymous, "ROUTER uses a generated UUID");
    s_dump (sink);

    zmq_close (sink);
    zmq_close (anonymous);
    zmq_term (context);
    return 0;
}
#+END_SRC
#+BEGIN_EXAMPLE
[zhangyan@tc-cm-et18.tc.baidu.com]$ ./env
----------------------------------------
[017] 0011A54BD30A5A4FA589A7C2C2860926BA
[028] ROUTER uses a generated UUID
----------------------------------------
[017] 0011A54BD30A5A4FA589A7C2C2860926BA
[028] ROUTER uses a generated UUID
#+END_EXAMPLE

最后不管是DEALER还是REP来进行处理的话，都需要解包。只不过DEALER没有自动处理，需要我们自己在应用层解开多个message part,然后保存起来。当需要回复消息的时候，
在头部重新加上这些message part.这种方式比较灵活可以用来做异步处理。而REP逻辑就非常简单，一直解包直到第一个empty message part将其保存起来，然后当send出去的时候在头部包装，
这就解释了为什么，REP必须是一个lockstep的过程，不然的话整个逻辑就会混乱。

如果理解了ROUTER/DEALER/REQ/REP的机制之后的话，就比较容易理解如何构建一个异步客户端和服务器模型了。http://zguide.zeromq.org/page:all#Asynchronous-Client-Server .

** API
关于API这一节的话提供的都是从ZeroMQ的代码文档里面得到的非常详细。但是我想针对里面一些具体的函数说一些或者是记下一些自己的体会，因为里面有坑或者是有思想。

*** Description
0MQ是一个轻量级的消息传递内核，扩展了socket接口。同时内置了很多新的特性，比如异步队列，多消息，消息订阅和过滤，不同transport的兼容等。

The 0MQ lightweight messaging kernel is a library which extends the standard socket interfaces with features traditionally provided by specialised messaging middleware products. 0MQ sockets provide an abstraction of asynchronous message queues, multiple messaging patterns, message filtering (subscriptions), seamless access to multiple transport protocols and more.

对于transport的话从现在0MQ看实现了下面几种，这个会在transports里面细说：
- tcp
- ipc
- inproc
- pgm/epgm
用户大致上只需要修改工作的uri底层就可以切换实现，非常方面。对于异步队列的话，就是使用inproc这个transports来完成的。

我在编写同步rpc方面使用了0MQ,在这里面多消息基本上一无是处，因为这个东西完全可以在上层将所有的消息(对象)打包称为一个消息然后发送，只要上层提供了足够方便的多个对象的序列化和反序列化接口即可，多消息模式完全没有意义。消息订阅和过滤从之前的文档来看是按照消息的头几个字节来判断的，但是因为pub-sub模式可能会丢消息，所以在我们项目里面没有使用。项目里面使用的就是这个链接里面提到的模型 http://zguide.zeromq.org/page:all#toc38 （NOTE@201712：当时对于0MQ看待非常狭隘，0MQ本身并不是一个RPC实现。它可以用来实现RPC，但是其实它有更多的非常好的特性可以用于实际生产中）

*** Context
我理解context对于0MQ来说就好比是epoll线程的句柄，然后之后所有的建立的socket都会在这个线程里面进行监听。当然整个app通常来说只需要创建一次就可以了，然后在app之前等待结束即可。

首先通过zmq_init来进行初始化
#+BEGIN_SRC C++
// The io_threads argument specifies the size of the 0MQ thread pool to handle I/O operations.
// If your application is using only the inproc transport for messaging you may set this to zero, otherwise set it to at least one.
void *zmq_init (int io_threads);
#+END_SRC
其中io_threads指定的就是线程个数。

然后在app销毁的时候调用zmq_term来销毁这个epoll线程句柄以及开辟的epoll线程。原型非常简单
#+BEGIN_SRC C++
int zmq_term (void *context);
#+END_SRC
但是语义以及返回值有点麻烦。

Context termination is performed in the following steps:
- Any blocking operations currently in progress on sockets open within context shall return immediately with an error code of ETERM. With the exception of zmq_close(), any further operations on sockets open within context shall fail with an error code of ETERM.
- After interrupting all blocking calls, zmq_term() shall block until the following conditions are satisfied:
   - All sockets open within context have been closed with zmq_close().
   - For each socket within context, all messages sent by the application with zmq_send() have either been physically transferred to a network peer, or the socket’s linger period set with the ZMQ_LINGER socket option has expired.
一旦zmq_term的话那么所有正在block operations的话都会返回ZMQ_TERM这个错误。但后一旦中断这个错误之后的话，会一直等待直到socket调用zmq_close,如果还设置了LINGER这个选项的话，那么会等待数据到达到了对端或者是linger超时位置。返回值的话可能会
- EFAULT.context本身无效
- EINTR.调用被信号处理中断，这个时候可以重新发起zmq_term这个操作。
虽然解释非常清楚，但是对于我们大部分用户来说，真的不会设置LINGER选项，并且都会等待所有线程执行完毕之后才会调用zmq_term来释放句柄。

