src/zeromq.org
*** Messages
对于Messages而言的话，就是ZMQ传输的消息单元体。通过message得到内容有两种方法
- zmq_msg_data
- zmq_msg_size
非常简单。另外还有两个操作方式
- zmq_msg_copy // 返回EFAULT表示src是无效的message.对于底层的话如果share也只是采用引用计数方法所以不会出现ENOMEM的错误.
- zmq_msg_move // 返回EFAULT表示src是无效的message.同样底层销毁一个东西将控制权转移到另外一个对象，然后src调用init.
上面这些接口都非常简单，不容易出错。容易出错的就是初始化和销毁部分.

初始化有三种方法分别是
- zmq_msg_init // 初始化并且没有分配任何内存。比较适合在zmq_recv之前调用。始终成功
- zmq_msg_init_size // 以某个size进行初始化分配内存。这个比较适合在zmq_send之前的话我们将自己的数据copy进去。ENOMEM表示内存分配失败。
- zmq_msg_init_data // 以data,size进行初始化，msg里面持有内存指针。比较适合zmq_send我们自己的数据，但是我们需要提供send over销毁数据的回调函数。
我们这里仔细看看init_size以及init_data的实现.我们会发现msg里面还有一个content对象，然后content里面会包含一个头部以及data.并且对于content有引用计数。
这个非常好理解，尤其是这个message是以一种异步的方式进行发送的，所以必须有引用计数才能够搞定这件事情。
#+BEGIN_SRC C++
int zmq_msg_init_size (zmq_msg_t *msg_, size_t size_)
{
    if (size_ <= ZMQ_MAX_VSM_SIZE) {
        msg_->content = (zmq::msg_content_t*) ZMQ_VSM;
        msg_->flags = (unsigned char) ~ZMQ_MSG_MASK;
        msg_->vsm_size = (uint8_t) size_;
    }
    else {
        msg_->content =
            (zmq::msg_content_t*) malloc (sizeof (zmq::msg_content_t) + size_);
        if (!msg_->content) {
            errno = ENOMEM;
            return -1;
        }
        msg_->flags = (unsigned char) ~ZMQ_MSG_MASK;

        zmq::msg_content_t *content = (zmq::msg_content_t*) msg_->content;
        content->data = (void*) (content + 1);
        content->size = size_;
        content->ffn = NULL;
        content->hint = NULL;
        new (&content->refcnt) zmq::atomic_counter_t ();
    }
    return 0;
}

int zmq_msg_init_data (zmq_msg_t *msg_, void *data_, size_t size_,
    zmq_free_fn *ffn_, void *hint_)
{
    msg_->content = (zmq::msg_content_t*) malloc (sizeof (zmq::msg_content_t));
    alloc_assert (msg_->content);
    msg_->flags = (unsigned char) ~ZMQ_MSG_MASK;
    zmq::msg_content_t *content = (zmq::msg_content_t*) msg_->content;
    content->data = data_;
    content->size = size_;
    content->ffn = ffn_;
    content->hint = hint_;
    new (&content->refcnt) zmq::atomic_counter_t ();
    return 0;
}
#+END_SRC

了解了初始化的逻辑之后，对于销毁逻辑就非常清楚了。但是我们最好看看这个实现
#+BEGIN_SRC C++
int zmq_msg_close (zmq_msg_t *msg_)
{
    // 这个地方是会检查标志的，这样可以放置多次释放造成错误的结果
    //  Check the validity tag.
    if (unlikely (msg_->flags | ZMQ_MSG_MASK) != 0xff) {
        errno = EFAULT;
        return -1;
    }
    // 如果里面需要进行释放的话
    //  For VSMs and delimiters there are no resources to free.
    if (msg_->content != (zmq::msg_content_t*) ZMQ_DELIMITER &&
          msg_->content != (zmq::msg_content_t*) ZMQ_VSM) {

        //  If the content is not shared, or if it is shared and the reference.
        //  count has dropped to zero, deallocate it.
        zmq::msg_content_t *content = (zmq::msg_content_t*) msg_->content;
		// 那么会使用引用计数进行计算.
        if (!(msg_->flags & ZMQ_MSG_SHARED) || !content->refcnt.sub (1)) {

            //  We used "placement new" operator to initialize the reference.
            //  counter so we call its destructor now.
            content->refcnt.~atomic_counter_t ();
			// 释放自己内部的内存.
            if (content->ffn)
                content->ffn (content->data, content->hint);
            free (content);
        }
    }
	// 然后底层会将这个flags清空.以防多次释放.
    //  Remove the validity tag from the message.
    msg_->flags = 0;

    return 0;
}
#+END_SRC

然后这里看看message的WireFormat.所谓的wireformat就是指message的打包方式。zeromq对于底层打包方式非常简单，原理就是bodylen+data(包含flags固定1字节)
- 如果body_len < 254.那么这个可以使用1个字节表示body_len. (body_len(1byte) + flags(1byte) + data)
- 如果body_len >= 254的话，zeromq使用8字节表示body_len. (0xff(特殊标记) + body_len(network order,8bytes) + flags(1byte) + data)
在大部分情况消息非常短使用1个字节表示body_len就可以搞定:).

