html/zeromq.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Messages</h3>
<div class="outline-text-3" id="text-3-3">
<p>
对于Messages而言的话，就是ZMQ传输的消息单元体。通过message得到内容有两种方法
</p>
<ul class="org-ul">
<li>zmq_msg_data
</li>
<li>zmq_msg_size
</li>
</ul>
<p>
非常简单。另外还有两个操作方式
</p>
<ul class="org-ul">
<li>zmq_msg_copy // 返回EFAULT表示src是无效的message.对于底层的话如果share也只是采用引用计数方法所以不会出现ENOMEM的错误.
</li>
<li>zmq_msg_move // 返回EFAULT表示src是无效的message.同样底层销毁一个东西将控制权转移到另外一个对象，然后src调用init.
</li>
</ul>
<p>
上面这些接口都非常简单，不容易出错。容易出错的就是初始化和销毁部分.
</p>

<p>
初始化有三种方法分别是
</p>
<ul class="org-ul">
<li>zmq_msg_init // 初始化并且没有分配任何内存。比较适合在zmq_recv之前调用。始终成功
</li>
<li>zmq_msg_init_size // 以某个size进行初始化分配内存。这个比较适合在zmq_send之前的话我们将自己的数据copy进去。ENOMEM表示内存分配失败。
</li>
<li>zmq_msg_init_data // 以data,size进行初始化，msg里面持有内存指针。比较适合zmq_send我们自己的数据，但是我们需要提供send over销毁数据的回调函数。
</li>
</ul>
<p>
我们这里仔细看看init_size以及init_data的实现.我们会发现msg里面还有一个content对象，然后content里面会包含一个头部以及data.并且对于content有引用计数。
这个非常好理解，尤其是这个message是以一种异步的方式进行发送的，所以必须有引用计数才能够搞定这件事情。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">int</span> <span class="org-function-name">zmq_msg_init_size</span> (<span class="org-type">zmq_msg_t</span> *<span class="org-variable-name">msg_</span>, <span class="org-type">size_t</span> <span class="org-variable-name">size_</span>)
{
    <span class="org-keyword">if</span> (size_ &lt;= ZMQ_MAX_VSM_SIZE) {
        msg_-&gt;content = (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) ZMQ_VSM;
        msg_-&gt;flags = (<span class="org-type">unsigned</span> <span class="org-type">char</span>) ~ZMQ_MSG_MASK;
        msg_-&gt;vsm_size = (<span class="org-type">uint8_t</span>) size_;
    }
    <span class="org-keyword">else</span> {
        msg_-&gt;content =
            (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) malloc (<span class="org-keyword">sizeof</span> (<span class="org-constant">zmq</span>::msg_content_t) + size_);
        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>msg_-&gt;content) {
            errno = ENOMEM;
            <span class="org-keyword">return</span> -1;
        }
        msg_-&gt;flags = (<span class="org-type">unsigned</span> <span class="org-type">char</span>) ~ZMQ_MSG_MASK;

        <span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span> *<span class="org-variable-name">content</span> = (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) msg_-&gt;content;
        content-&gt;data = (<span class="org-type">void</span>*) (content + 1);
        content-&gt;size = size_;
        content-&gt;ffn = <span class="org-constant">NULL</span>;
        content-&gt;hint = <span class="org-constant">NULL</span>;
        <span class="org-keyword">new</span> (&amp;content-&gt;refcnt) <span class="org-constant">zmq</span>::<span class="org-type">atomic_counter_t</span> ();
    }
    <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">zmq_msg_init_data</span> (<span class="org-type">zmq_msg_t</span> *<span class="org-variable-name">msg_</span>, <span class="org-type">void</span> *<span class="org-variable-name">data_</span>, <span class="org-type">size_t</span> <span class="org-variable-name">size_</span>,
    <span class="org-type">zmq_free_fn</span> *<span class="org-variable-name">ffn_</span>, <span class="org-type">void</span> *<span class="org-variable-name">hint_</span>)
{
    msg_-&gt;content = (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) malloc (<span class="org-keyword">sizeof</span> (<span class="org-constant">zmq</span>::msg_content_t));
    alloc_assert (msg_-&gt;content);
    msg_-&gt;flags = (<span class="org-type">unsigned</span> <span class="org-type">char</span>) ~ZMQ_MSG_MASK;
    <span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span> *<span class="org-variable-name">content</span> = (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) msg_-&gt;content;
    content-&gt;data = data_;
    content-&gt;size = size_;
    content-&gt;ffn = ffn_;
    content-&gt;hint = hint_;
    <span class="org-keyword">new</span> (&amp;content-&gt;refcnt) <span class="org-constant">zmq</span>::<span class="org-type">atomic_counter_t</span> ();
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
了解了初始化的逻辑之后，对于销毁逻辑就非常清楚了。但是我们最好看看这个实现
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">int</span> <span class="org-function-name">zmq_msg_close</span> (<span class="org-type">zmq_msg_t</span> *<span class="org-variable-name">msg_</span>)
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#36825;&#20010;&#22320;&#26041;&#26159;&#20250;&#26816;&#26597;&#26631;&#24535;&#30340;&#65292;&#36825;&#26679;&#21487;&#20197;&#25918;&#32622;&#22810;&#27425;&#37322;&#25918;&#36896;&#25104;&#38169;&#35823;&#30340;&#32467;&#26524;</span>
    <span class="org-comment-delimiter">//  </span><span class="org-comment">Check the validity tag.</span>
    <span class="org-keyword">if</span> (unlikely (msg_-&gt;flags | ZMQ_MSG_MASK) != 0xff) {
        errno = EFAULT;
        <span class="org-keyword">return</span> -1;
    }
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#22914;&#26524;&#37324;&#38754;&#38656;&#35201;&#36827;&#34892;&#37322;&#25918;&#30340;&#35805;</span>
    <span class="org-comment-delimiter">//  </span><span class="org-comment">For VSMs and delimiters there are no resources to free.</span>
    <span class="org-keyword">if</span> (msg_-&gt;content != (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) ZMQ_DELIMITER &amp;&amp;
          msg_-&gt;content != (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) ZMQ_VSM) {

        <span class="org-comment-delimiter">//  </span><span class="org-comment">If the content is not shared, or if it is shared and the reference.</span>
        <span class="org-comment-delimiter">//  </span><span class="org-comment">count has dropped to zero, deallocate it.</span>
        <span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span> *<span class="org-variable-name">content</span> = (<span class="org-constant">zmq</span>::<span class="org-type">msg_content_t</span>*) msg_-&gt;content;
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#37027;&#20040;&#20250;&#20351;&#29992;&#24341;&#29992;&#35745;&#25968;&#36827;&#34892;&#35745;&#31639;.</span>
        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>(msg_-&gt;flags &amp; ZMQ_MSG_SHARED) || <span class="org-negation-char">!</span>content-&gt;refcnt.sub (1)) {

            <span class="org-comment-delimiter">//  </span><span class="org-comment">We used "placement new" operator to initialize the reference.</span>
            <span class="org-comment-delimiter">//  </span><span class="org-comment">counter so we call its destructor now.</span>
            content-&gt;refcnt.~atomic_counter_t ();
            <span class="org-comment-delimiter">// </span><span class="org-comment">&#37322;&#25918;&#33258;&#24049;&#20869;&#37096;&#30340;&#20869;&#23384;.</span>
            <span class="org-keyword">if</span> (content-&gt;ffn)
                content-&gt;ffn (content-&gt;data, content-&gt;hint);
            free (content);
        }
    }
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#28982;&#21518;&#24213;&#23618;&#20250;&#23558;&#36825;&#20010;flags&#28165;&#31354;.&#20197;&#38450;&#22810;&#27425;&#37322;&#25918;.</span>
    <span class="org-comment-delimiter">//  </span><span class="org-comment">Remove the validity tag from the message.</span>
    msg_-&gt;flags = 0;

    <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
然后这里看看message的WireFormat.所谓的wireformat就是指message的打包方式。zeromq对于底层打包方式非常简单，原理就是bodylen+data(包含flags固定1字节)
</p>
<ul class="org-ul">
<li>如果body_len &lt; 254.那么这个可以使用1个字节表示body_len. (body_len(1byte) + flags(1byte) + data)
</li>
<li>如果body_len &gt;= 254的话，zeromq使用8字节表示body_len. (0xff(特殊标记) + body_len(network order,8bytes) + flags(1byte) + data)
</li>
</ul>
<p>
在大部分情况消息非常短使用1个字节表示body_len就可以搞定:).
</p>
</div>
</div>
