src/zeromq.org
*** Sockets
使用zmq_socket和zmq_close就可以创建和销毁socket.对于socket具体的类型的话可以参看文档，写得非常的详细。
#+BEGIN_SRC C++
// 错误可能有下面这些
// 1.EINVAL type不合法
// 2.EFAULT context无效
// 3.EMFILE 文件句柄不够
// 4.ETERM context已经被zmq_term了.
void *zmq_socket (void *context, int type);

// 错误可能有下面这些
// 1.ENOTSOCk 这个socket不合法
int zmq_close (void *socket);
#+END_SRC
创建和销毁接口都非常简单不容易出现错误.

然后剩下要做的就是创建服务端(bind)或者是客户端(connect).必须注意到zmq这里提供了一个很方便的东西，
就是connect本身也是一个异步过程。如果本次没有完成连接的话，那么下次隔断时间又会重新尝试发起连接。
#+BEGIN_SRC C++
// 其中endpoint根据不同的transport表达方式不同.这个后面会提到
// 可能的错误有下面这些
// 1.EPROTONOSUPPORT endpoint的transport有问题
// 2.ENOCOMPATPROTO  endpoint的transport和socket不兼容
// 3.EADDRINUSE address already in use.
// 4.EADDRNOTAVAIL address not available
// 5.ENODEV address指定了一个不存在的device.
// 6.ETERM context正在被销毁
// 7.ENOTSOCK socket无效
// 8.EMTHREAD 没有epoll IO线程完成这个task
// 其实觉得大部分的错误我们是没有必要处理的,EADDRINUSE可能是错常见的错误了.
int zmq_bind (void *socket, const char *endpoint);

// 可能的错误有下面这些
// EPROTONOSUPPORT endpoint的transport有问题
// ENOCOMPATPROTO  endpoint的transport和socket不兼容
// ETERM  context正在被销毁
// ENOTSOCK  socket无效
// EMTHREAD  没有epoll IO线程完成这个task
// 所以这里的大部分错误都可以忽略的.
int zmq_connect (void *socket, const char *endpoint);
#+END_SRC

接下来的部分就是读写了。zeromq读写都是针对message来操作的，允许操作multipart messages.但是个人现在看起来，
觉得multipart messages似乎没有什么太大的用途:(.因为两个接口面向对象都是message,对于十分简单
#+BEGIN_SRC C++
// 其中flags可以为ZMQ_NOBLOCK与ZMQ_SNDMORE(表示发送多消息，0表示结束)
// 这里NOBLOCK的含义是，如果不能够理解丢入异步消息队列的话，那么就立刻返回
// 可能的错误有下面这些
// EAGAIN 异步队列已满
// ENOTSUP socket不支持zmq_send
// EFSM socket的状态机错误(因为每种类型的socket允许操作顺序是不同的)
// ETERM context正在被销毁
// ENOTSOCK 无效的socket
// EINTR 被信号中断
// EFAULT 无效的message
// 事实上我们关注的可以很少，如果不用noblock的话，我们只需要关心EINTR.通常来说处理逻辑就是重新发起
// 如果用noblock在关注EAGAIN这个错误.
int zmq_send (void *socket, zmq_msg_t *msg, int flags);

// 其中flags只允许是ZMQ_NOBLOCK.如果异步消息队列里面没有数据的话，那么就返回
// 对于多条消息的话需要通过判断socket选项来决定是否还有更多消息(所以说麻烦).
// 可能的错误有下面这些
// EAGAIN 异步队列空
// ENOTSUP socket不支持zmq_recv
// EFSM 状态机存在问题
// ETERM context正在被销毁
// ENOTSOCK 无效socket
// EINTR 被信号中断
// EFAULT 无效的message
// 和zmq_send一样，如果不用noblock的话，我们只需要关心EINTR。如果关注noblock的话就再处理EAGAIN这个错误。
int zmq_recv (void *socket, zmq_msg_t *msg, int flags);
#+END_SRC

socket还允许使用poll来观察socket是否可读可写.zmq_poll提供的接口和poll非常相似
#+BEGIN_SRC C++
typedef struct
{
    void *socket; // 可以使用zmq_socket
    int fd; // 也可以使用fd
    short events;
    short revents;
} zmq_pollitem_t;
int zmq_poll (zmq_pollitem_t *items, int nitems, long timeout); // -1表示没有超时
#+END_SRC
这里的events包括下面这些
- ZMQ_POLLIN
- ZMQ_POLLOUT
- ZMQ_POLLERR // 这个仅仅对于fd有用.
如果纯粹使用zeromq发送的话，应该只需要关注POLLIN与POLLOUT即可。返回值的语义表示有多少个items ready了.
可能包含下面这些错误
- ETERM context正在被销毁
- EFAULT items本身参数无效(NULL)
- EINTR 信号中断 // 通常我们最关心的错误
poll这个接口对于device需要.

