html/zeromq.html

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Sockets</h3>
<div class="outline-text-3" id="text-3-4">
<p>
使用zmq_socket和zmq_close就可以创建和销毁socket.对于socket具体的类型的话可以参看文档，写得非常的详细。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">// </span><span class="org-comment">&#38169;&#35823;&#21487;&#33021;&#26377;&#19979;&#38754;&#36825;&#20123;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">1.EINVAL type&#19981;&#21512;&#27861;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">2.EFAULT context&#26080;&#25928;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">3.EMFILE &#25991;&#20214;&#21477;&#26564;&#19981;&#22815;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">4.ETERM context&#24050;&#32463;&#34987;zmq_term&#20102;.</span>
<span class="org-type">void</span> *<span class="org-function-name">zmq_socket</span> (<span class="org-type">void</span> *<span class="org-variable-name">context</span>, <span class="org-type">int</span> <span class="org-variable-name">type</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">&#38169;&#35823;&#21487;&#33021;&#26377;&#19979;&#38754;&#36825;&#20123;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">1.ENOTSOCk &#36825;&#20010;socket&#19981;&#21512;&#27861;</span>
<span class="org-type">int</span> <span class="org-function-name">zmq_close</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>);
</pre>
</div>
<p>
创建和销毁接口都非常简单不容易出现错误.
</p>

<p>
然后剩下要做的就是创建服务端(bind)或者是客户端(connect).必须注意到zmq这里提供了一个很方便的东西，
就是connect本身也是一个异步过程。如果本次没有完成连接的话，那么下次隔断时间又会重新尝试发起连接。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">// </span><span class="org-comment">&#20854;&#20013;endpoint&#26681;&#25454;&#19981;&#21516;&#30340;transport&#34920;&#36798;&#26041;&#24335;&#19981;&#21516;.&#36825;&#20010;&#21518;&#38754;&#20250;&#25552;&#21040;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#33021;&#30340;&#38169;&#35823;&#26377;&#19979;&#38754;&#36825;&#20123;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">1.EPROTONOSUPPORT endpoint&#30340;transport&#26377;&#38382;&#39064;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">2.ENOCOMPATPROTO  endpoint&#30340;transport&#21644;socket&#19981;&#20860;&#23481;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">3.EADDRINUSE address already in use.</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">4.EADDRNOTAVAIL address not available</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">5.ENODEV address&#25351;&#23450;&#20102;&#19968;&#20010;&#19981;&#23384;&#22312;&#30340;device.</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">6.ETERM context&#27491;&#22312;&#34987;&#38144;&#27585;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">7.ENOTSOCK socket&#26080;&#25928;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">8.EMTHREAD &#27809;&#26377;epoll IO&#32447;&#31243;&#23436;&#25104;&#36825;&#20010;task</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#20854;&#23454;&#35273;&#24471;&#22823;&#37096;&#20998;&#30340;&#38169;&#35823;&#25105;&#20204;&#26159;&#27809;&#26377;&#24517;&#35201;&#22788;&#29702;&#30340;,EADDRINUSE&#21487;&#33021;&#26159;&#38169;&#24120;&#35265;&#30340;&#38169;&#35823;&#20102;.</span>
<span class="org-type">int</span> <span class="org-function-name">zmq_bind</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-variable-name">endpoint</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#33021;&#30340;&#38169;&#35823;&#26377;&#19979;&#38754;&#36825;&#20123;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EPROTONOSUPPORT endpoint&#30340;transport&#26377;&#38382;&#39064;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ENOCOMPATPROTO  endpoint&#30340;transport&#21644;socket&#19981;&#20860;&#23481;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ETERM  context&#27491;&#22312;&#34987;&#38144;&#27585;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ENOTSOCK  socket&#26080;&#25928;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EMTHREAD  &#27809;&#26377;epoll IO&#32447;&#31243;&#23436;&#25104;&#36825;&#20010;task</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#25152;&#20197;&#36825;&#37324;&#30340;&#22823;&#37096;&#20998;&#38169;&#35823;&#37117;&#21487;&#20197;&#24573;&#30053;&#30340;.</span>
<span class="org-type">int</span> <span class="org-function-name">zmq_connect</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-variable-name">endpoint</span>);
</pre>
</div>

<p>
接下来的部分就是读写了。zeromq读写都是针对message来操作的，允许操作multipart messages.但是个人现在看起来，
觉得multipart messages似乎没有什么太大的用途:(.因为两个接口面向对象都是message,对于十分简单
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">// </span><span class="org-comment">&#20854;&#20013;flags&#21487;&#20197;&#20026;ZMQ_NOBLOCK&#19982;ZMQ_SNDMORE(&#34920;&#31034;&#21457;&#36865;&#22810;&#28040;&#24687;&#65292;0&#34920;&#31034;&#32467;&#26463;)</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#36825;&#37324;NOBLOCK&#30340;&#21547;&#20041;&#26159;&#65292;&#22914;&#26524;&#19981;&#33021;&#22815;&#29702;&#35299;&#20002;&#20837;&#24322;&#27493;&#28040;&#24687;&#38431;&#21015;&#30340;&#35805;&#65292;&#37027;&#20040;&#23601;&#31435;&#21051;&#36820;&#22238;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#33021;&#30340;&#38169;&#35823;&#26377;&#19979;&#38754;&#36825;&#20123;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EAGAIN &#24322;&#27493;&#38431;&#21015;&#24050;&#28385;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ENOTSUP socket&#19981;&#25903;&#25345;zmq_send</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EFSM socket&#30340;&#29366;&#24577;&#26426;&#38169;&#35823;(&#22240;&#20026;&#27599;&#31181;&#31867;&#22411;&#30340;socket&#20801;&#35768;&#25805;&#20316;&#39034;&#24207;&#26159;&#19981;&#21516;&#30340;)</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ETERM context&#27491;&#22312;&#34987;&#38144;&#27585;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ENOTSOCK &#26080;&#25928;&#30340;socket</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EINTR &#34987;&#20449;&#21495;&#20013;&#26029;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EFAULT &#26080;&#25928;&#30340;message</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#20107;&#23454;&#19978;&#25105;&#20204;&#20851;&#27880;&#30340;&#21487;&#20197;&#24456;&#23569;&#65292;&#22914;&#26524;&#19981;&#29992;noblock&#30340;&#35805;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#20851;&#24515;EINTR.&#36890;&#24120;&#26469;&#35828;&#22788;&#29702;&#36923;&#36753;&#23601;&#26159;&#37325;&#26032;&#21457;&#36215;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#22914;&#26524;&#29992;noblock&#22312;&#20851;&#27880;EAGAIN&#36825;&#20010;&#38169;&#35823;.</span>
<span class="org-type">int</span> <span class="org-function-name">zmq_send</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-type">zmq_msg_t</span> *<span class="org-variable-name">msg</span>, <span class="org-type">int</span> <span class="org-variable-name">flags</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">&#20854;&#20013;flags&#21482;&#20801;&#35768;&#26159;ZMQ_NOBLOCK.&#22914;&#26524;&#24322;&#27493;&#28040;&#24687;&#38431;&#21015;&#37324;&#38754;&#27809;&#26377;&#25968;&#25454;&#30340;&#35805;&#65292;&#37027;&#20040;&#23601;&#36820;&#22238;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#23545;&#20110;&#22810;&#26465;&#28040;&#24687;&#30340;&#35805;&#38656;&#35201;&#36890;&#36807;&#21028;&#26029;socket&#36873;&#39033;&#26469;&#20915;&#23450;&#26159;&#21542;&#36824;&#26377;&#26356;&#22810;&#28040;&#24687;(&#25152;&#20197;&#35828;&#40635;&#28902;).</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#33021;&#30340;&#38169;&#35823;&#26377;&#19979;&#38754;&#36825;&#20123;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EAGAIN &#24322;&#27493;&#38431;&#21015;&#31354;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ENOTSUP socket&#19981;&#25903;&#25345;zmq_recv</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EFSM &#29366;&#24577;&#26426;&#23384;&#22312;&#38382;&#39064;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ETERM context&#27491;&#22312;&#34987;&#38144;&#27585;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ENOTSOCK &#26080;&#25928;socket</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EINTR &#34987;&#20449;&#21495;&#20013;&#26029;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">EFAULT &#26080;&#25928;&#30340;message</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#21644;zmq_send&#19968;&#26679;&#65292;&#22914;&#26524;&#19981;&#29992;noblock&#30340;&#35805;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#20851;&#24515;EINTR&#12290;&#22914;&#26524;&#20851;&#27880;noblock&#30340;&#35805;&#23601;&#20877;&#22788;&#29702;EAGAIN&#36825;&#20010;&#38169;&#35823;&#12290;</span>
<span class="org-type">int</span> <span class="org-function-name">zmq_recv</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-type">zmq_msg_t</span> *<span class="org-variable-name">msg</span>, <span class="org-type">int</span> <span class="org-variable-name">flags</span>);
</pre>
</div>

<p>
socket还允许使用poll来观察socket是否可读可写.zmq_poll提供的接口和poll非常相似
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">typedef</span> <span class="org-keyword">struct</span>
{
    <span class="org-type">void</span> *<span class="org-variable-name">socket</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#20197;&#20351;&#29992;zmq_socket</span>
    <span class="org-type">int</span> <span class="org-variable-name">fd</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#20063;&#21487;&#20197;&#20351;&#29992;fd</span>
    <span class="org-type">short</span> <span class="org-variable-name">events</span>;
    <span class="org-type">short</span> <span class="org-variable-name">revents</span>;
} <span class="org-type">zmq_pollitem_t</span>;
<span class="org-type">int</span> <span class="org-function-name">zmq_poll</span> (<span class="org-type">zmq_pollitem_t</span> *<span class="org-variable-name">items</span>, <span class="org-type">int</span> <span class="org-variable-name">nitems</span>, <span class="org-type">long</span> <span class="org-variable-name">timeout</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">-1&#34920;&#31034;&#27809;&#26377;&#36229;&#26102;</span>
</pre>
</div>
<p>
这里的events包括下面这些
</p>
<ul class="org-ul">
<li>ZMQ_POLLIN
</li>
<li>ZMQ_POLLOUT
</li>
<li>ZMQ_POLLERR // 这个仅仅对于fd有用.
</li>
</ul>
<p>
如果纯粹使用zeromq发送的话，应该只需要关注POLLIN与POLLOUT即可。返回值的语义表示有多少个items ready了.
可能包含下面这些错误
</p>
<ul class="org-ul">
<li>ETERM context正在被销毁
</li>
<li>EFAULT items本身参数无效(NULL)
</li>
<li>EINTR 信号中断 // 通常我们最关心的错误
</li>
</ul>
<p>
poll这个接口对于device需要.
</p>
</div>
</div>
