html/zeromq.html

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Options</h3>
<div class="outline-text-3" id="text-3-5">
<p>
允许获取和设置的options并不是一样的，所以这里列出所有的options.获取的话标记R,设置的话标记W
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">int</span> <span class="org-function-name">zmq_getsockopt</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-type">int</span> <span class="org-variable-name">option_name</span>, <span class="org-type">void</span> *<span class="org-variable-name">option_value</span>, <span class="org-type">size_t</span> *<span class="org-variable-name">option_len</span>);
<span class="org-type">int</span> <span class="org-function-name">zmq_setsockopt</span> (<span class="org-type">void</span> *<span class="org-variable-name">socket</span>, <span class="org-type">int</span> <span class="org-variable-name">option_name</span>, <span class="org-keyword">const</span> <span class="org-type">void</span> *<span class="org-variable-name">option_value</span>, <span class="org-type">size_t</span> <span class="org-variable-name">option_len</span>);
</pre>
</div>
<ul class="org-ul">
<li>ZMQ_TYPE(R) 获取socket type.
</li>
<li>ZMQ_RCVMORE(R) socket是否还有更多的multipart message.
</li>
<li>ZMQ_HWM(RW) HWM(high water mark).表示允许在内存异步队列里面存放多少消息.如果达到上限的话那么要不阻塞发送，要不丢弃消息(PUB).默认是没有限制.
</li>
<li>ZMQ_SWAP(RW) 如果达到HWM的话，那么允许swap到磁盘。这个值表示允许swap的最大大小，默认为0就是不进行swap.
</li>
<li>ZMQ_AFFINITY(RW) 获取socket和io_threads的亲和性(在哪些线程上工作).返回的值一个bitmap(uint64_t).这就意味这io_threads可以多达64个
</li>
<li>ZMQ_IDENTITY(RW) 获取socket的id.如果自己设置id的话重新连接服务端的话，服务端还可以上次的消息续传。默认使用uuid分配每次启动不同。(不太清楚)
</li>
<li>ZMQ_RATE(RW) 广播的收发速率.(不太清楚广播)
</li>
<li>ZMQ_RECOVERY_IVL(RW) 广播恢复的间隔,单位是s.(不太清楚广播)
</li>
<li>ZMQ_RECOVERY_IVL_MSEC(RW) 广播恢复的间隔，单位是ms.现在推荐使用这个选项.(不太清楚广播)
</li>
<li>ZMQ_MCAST_LOOP(RW) 广播是否可以走回环.(不太清楚广播)
</li>
<li>ZMQ_SNDBUF(RW) socket底层的send buffer大小
</li>
<li>ZMQ_RCVBUF(RW) socket底层的recv buffer大小
</li>
<li>ZMQ_LINGER(RW) socket底层进行linger的时间
</li>
<li>ZMQ_RECONNECT_IVL(RW) 重连的时间间隔(默认100ms)
</li>
<li>ZMQ_RECONNECT_IVL_MAX(RW) 重连的最大时间间隔(默认==IVL).原理是使用IVL开始然后每次*2来进行直到到达MAX来解决这个问题.但是默认的话不会出现指数退避.
</li>
<li>ZMQ_BACKLOG(RW) listen backlog(默认100)
</li>
<li>ZMQ_FD(R) 取出底层的fd
</li>
<li>ZMQ_EVENTS(R) socket的可读写事件，包括ZMQ_POLLIN与ZMQ_POLLOUT
</li>
<li>ZMQ_SUBSCRIBE(W) 设置subscribe过滤数据.因为subscribe是根据消息内容头部来过滤的.
</li>
<li>ZMQ_UNSUBSCRIBE(W) 取消subscribe过滤数据.
</li>
</ul>

<p>
对于获取和设置option的错误可能有下面这些
</p>
<ul class="org-ul">
<li>EINVAL 无效参数
</li>
<li>ETERM context正在被销毁
</li>
<li>ENOTSOCK socket无效
</li>
<li>EINTR 调用被中断
</li>
</ul>
<p>
可能我们唯一需要处理的就是EINTR把.对于选项的话我们可能最多设置一下SNDBUF与RCVBUF.可能reconnect时间需要调整一下.
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Transports</h3>
<div class="outline-text-3" id="text-3-6">
<p>
transport是指zeromq的传输层在载体，一共有下面4种.
</p>
<ul class="org-ul">
<li>tcp
</li>
<li>pgm
</li>
<li>ipc
</li>
<li>inproc
</li>
</ul>
<p>
这里因为对于pgm不是很了解所以不做过多分析:)zeromq底层根据不同的传输层载体进行了封装，只需要在bind或者是connect替换endpoint即可。
所以这里只是看看endpoint的表示方法并且看看一些可能的潜在问题。endpoint的表示方法如下
</p>
<pre class="example">
transport://endpoint
</pre>

<p>
对于tcp的bind来说的，最常用的两个方式就是
</p>
<ul class="org-ul">
<li>tcp://127.0.0.1:80
</li>
<li>tcp://*:80
</li>
</ul>
<p>
而对于connect来说的话，可以使用的方式就是
</p>
<ul class="org-ul">
<li>tcp://dirlt.com:80
</li>
<li>tcp://127.0.0.1:80
</li>
</ul>
<p>
注意这里一定需要提供端口号。事实上不指定端口也行，zeromq只需要修改很少代码即可。端口可以另外获取然后传输到zookeeeper等介质上面。
但是我猜想这样就破坏了zeromq的封装原则了，所以没有这么做:).
</p>

<p>
对于ipc来说的话，底层使用了unix domain socket来完成进程之间通信。unix domain socket走loopback接口，没有网卡限制也不会耗CPU中断.
如果了解unix domain socket的话，那么知道对应的ip地址在这里映射成为就是文本的一个特殊的unix domain socket文件，所以我们需要提供文件名。
方式就是 `ipc://pathname `. 如果path不是绝对路径的话，那么就以当前目录开始。但是通常来说以绝对路径操作会更加方便，
</p>

<p>
所谓的inproc就是说在进程内部通信就是线程之间的通信，实现上就是异步消息队列。因为不占用任何线程，所以如果只是使用inproc的话，
那么zmq_init的话io_threads可以==0.而endpoint仅仅是为了标识这个异步队列，给定一个名称即可。比如使用方式可以使： `inproc://#0`.
另外需要注意的就是，inproc的server必须首先创建好，然后client才可以connect过来，这点是有顺序的。
</p>
</div>
</div>
