html/zeromq.html

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Devices</h3>
<div class="outline-text-3" id="text-3-7">
<p>
关于Device的实现，虽然文档强调device必须配合frontend和backend，但是实际上代码只是使用一套。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">// </span><span class="org-comment">ZMQ_QUEUE starts a queue device</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ZMQ_FORWARDER starts a forwarder device</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">ZMQ_STREAMER starts a streamer device</span>
<span class="org-type">int</span> <span class="org-function-name">zmq_device</span> (<span class="org-type">int</span> <span class="org-variable-name">device</span>, <span class="org-keyword">const</span> <span class="org-type">void</span> *<span class="org-variable-name">frontend</span>, <span class="org-keyword">const</span> <span class="org-type">void</span> *<span class="org-variable-name">backend</span>);
</pre>
</div>
<p>
我们有必要研究一下device的写法，而且有时候我们可能不能用系统自带的zmq_device.好比zmq文档的multithreads的例子里面，
如果我们希望在每次轮询的时候可以检测一下外部的标记的话，那么就不能够使用自带的zmq_device。但是可以基于现在device简单修改即可.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">int</span> <span class="org-constant">zmq</span>::<span class="org-function-name">device</span> (<span class="org-keyword">class</span> <span class="org-type">socket_base_t</span> *<span class="org-variable-name">insocket_</span>,
        <span class="org-keyword">class</span> <span class="org-type">socket_base_t</span> *<span class="org-variable-name">outsocket_</span>)
{
    <span class="org-type">zmq_msg_t</span> <span class="org-variable-name">msg</span>;
    <span class="org-type">int</span> <span class="org-variable-name">rc</span> = zmq_msg_init (&amp;msg); <span class="org-comment-delimiter">// </span><span class="org-comment">&#20165;&#20165;&#21021;&#22987;&#21270;&#19968;&#27425;&#23601;&#21487;&#20197;&#65292;&#22240;&#20026;zmq_recv&#20250;&#33258;&#21160;&#24110;&#25105;&#20204;close:).</span>

    <span class="org-keyword">if</span> (rc != 0) {
        <span class="org-keyword">return</span> -1;
    }

    <span class="org-type">int64_t</span> <span class="org-variable-name">more</span>;
    <span class="org-type">size_t</span> <span class="org-variable-name">moresz</span>;

    <span class="org-type">zmq_pollitem_t</span> <span class="org-variable-name">items</span> [2];
    items [0].socket = insocket_;
    items [0].fd = 0;
    items [0].events = ZMQ_POLLIN;
    items [0].revents = 0;
    items [1].socket = outsocket_;
    items [1].fd = 0;
    items [1].events = ZMQ_POLLIN;
    items [1].revents = 0;

    <span class="org-keyword">while</span> (<span class="org-constant">true</span>) {

        <span class="org-comment-delimiter">//  </span><span class="org-comment">Wait while there are either requests or replies to process.</span>
        rc = zmq_poll (&amp;items [0], 2, -1); <span class="org-comment-delimiter">// </span><span class="org-comment">&#36825;&#20010;&#22320;&#26041;&#25105;&#20204;&#21487;&#20197;&#35774;&#32622;&#19968;&#19979;poll&#30340;&#36229;&#26102;&#26102;&#38388;</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#22914;&#26524;&#27809;&#26377;&#20219;&#20309;&#20869;&#23481;&#30340;&#35805;&#65292;&#25105;&#20204;&#21487;&#20197;&#27599;&#38548;&#19968;&#27573;&#26102;&#38388;&#21028;&#26029;&#19968;&#19979;&#22806;&#37096;&#26631;&#35760;</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#27604;&#22914;&#36825;&#37324;&#25105;&#20204;&#21487;&#20197;&#26816;&#27979;&#19968;&#19979;&#22806;&#37096;&#26159;&#21542;&#35774;&#32622;&#20102;exit&#30340;&#26631;&#35760;&#31561;&#12290;</span>
        <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
            <span class="org-keyword">return</span> -1;
        }

        <span class="org-comment-delimiter">//  </span><span class="org-comment">The algorithm below asumes ratio of request and replies processed</span>
        <span class="org-comment-delimiter">//  </span><span class="org-comment">under full load to be 1:1. Although processing requests replies</span>
        <span class="org-comment-delimiter">//  </span><span class="org-comment">first is tempting it is suspectible to DoS attacks (overloading</span>
        <span class="org-comment-delimiter">//  </span><span class="org-comment">the system with unsolicited replies).</span>

        <span class="org-comment-delimiter">//  </span><span class="org-comment">Process a request.</span>
        <span class="org-keyword">if</span> (items [0].revents &amp; ZMQ_POLLIN) {
            <span class="org-keyword">while</span> (<span class="org-constant">true</span>) {

                rc = insocket_-&gt;recv (&amp;msg, 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                moresz = <span class="org-keyword">sizeof</span> (more);
                rc = insocket_-&gt;getsockopt (ZMQ_RCVMORE, &amp;more, &amp;moresz);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                rc = outsocket_-&gt;send (&amp;msg, more ? ZMQ_SNDMORE : 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>more)
                    <span class="org-keyword">break</span>;
            }
        }

        <span class="org-comment-delimiter">//  </span><span class="org-comment">Process a reply.</span>
        <span class="org-keyword">if</span> (items [1].revents &amp; ZMQ_POLLIN) {
            <span class="org-keyword">while</span> (<span class="org-constant">true</span>) {

                rc = outsocket_-&gt;recv (&amp;msg, 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                moresz = <span class="org-keyword">sizeof</span> (more);
                rc = outsocket_-&gt;getsockopt (ZMQ_RCVMORE, &amp;more, &amp;moresz);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                rc = insocket_-&gt;send (&amp;msg, more ? ZMQ_SNDMORE : 0);
                <span class="org-keyword">if</span> (unlikely (rc &lt; 0)) {
                    <span class="org-keyword">return</span> -1;
                }

                <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>more)
                    <span class="org-keyword">break</span>;
            }
        }

    }

    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Philosophy</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Fixing the World</h3>
<div class="outline-text-3" id="text-4-1">
<p>
编程是一门被包装起来的艺术。大多数人认为编程的核心在于数据结构，算法，语言，以及抽象，但是这些都不是编程的核心，这些都只是工具。编程的核心，应该强调人的物理特性，就是交流。所以编程应该强调组合性，有很多可以相互交流的building blocks, 并且这些blocks可以被组装起来形成更大更加复杂的系统。ZMQ可以认为是这些blocks其中的一个。
</p>

<p>
Programming is a science dressed up as art, because most of us don't understand the physics of software, and it's rarely if ever taught. The physics of software is not algorithms, data structures, languages and abstractions. These are just tools we make, use, throw away. The real physics of software is the physics of people.
</p>

<p>
Specifically, our limitations when it comes to complexity, and our desire to work together to solve large problems in pieces. This is the science of programming: make building blocks that people can understand and use easily, and people will work together to solve the very largest problems.
</p>

<p>
We live in a connected world, and modern software has to navigate this world. So the building blocks for tomorrow's very largest solutions are connected and massively parallel. It's not enough for code to be "strong and silent" any more. Code has to talk to code. Code has to be chatty, sociable, well-connected. Code has to run like the human brain, trillions of individual neurons firing off messages to each other, a massively parallel network with no central control, no single point of failure, yet able to solve immensely difficult problems. And it's no accident that the future of code looks like the human brain, because the endpoints of every network are, at some level, human brains.
</p>
</div>
</div>
